{"id":1310,"date":"2019-10-07T15:24:45","date_gmt":"2019-10-07T15:24:45","guid":{"rendered":"https:\/\/www.searchberg.com\/blog\/?p=1310"},"modified":"2019-10-07T15:24:45","modified_gmt":"2019-10-07T15:24:45","slug":"10-ways-to-build-a-strong-personal-reputation-for-individuals-and-entrepreneurs","status":"publish","type":"post","link":"https:\/\/www.searchberg.com\/blog\/10-ways-to-build-a-strong-personal-reputation-for-individuals-and-entrepreneurs\/","title":{"rendered":"10 Ways to Build a Strong Personal Reputation For Individuals and Entrepreneurs"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1312\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2019\/10\/1-1.jpg\" alt=\"Ways to Build a Strong Personal Reputation\" width=\"750\" height=\"483\" \/><\/p>\n<p style=\"text-align: center;\"><em>When it comes to reputation management, companies and entrepreneurs will do anything to save face in times of trouble, even if <a href=\"https:\/\/www.cnbc.com\/2019\/03\/15\/dieselgate-sec-says-volkswagen-perpetrated-fraud-lied-to-investors.html\">that means lying<\/a>. However, there are better ways to tackle the mess.<\/em><\/p>\n<h2>Understanding Personal Reputation Building<\/h2>\n<p>The era of social media has enabled businesses to become more communicative and transparent regarding their operations. In this vein, C-level managers and executives have now become the face of a brand and its associated culture. Think of e-commerce giants like <a href=\"https:\/\/www.amazon.com\/\">Amazon<\/a> and <a href=\"https:\/\/www.alibaba.com\/\">Ali Baba<\/a>. They employ people in the thousands, yet Jeff Bezos and Jack Ma happen to be the ultimate representation of the norms and values of these conglomerates. Every move that they make is duly noted and associated with the organization they run.<\/p>\n<p>When it comes to managing your company’s reputation, there’s a whole lot of <a href=\"https:\/\/www.tandfonline.com\/doi\/abs\/10.1080\/14792779108401861?journalCode=pers20\">psychology<\/a> that goes into the mix. Business leaders must always be cognizant of their own personal brand; how the public perceives them and what they expect from their character.<\/p>\n<p>In the words of billionaire investor Warren Buffet; it takes decades to <a href=\"https:\/\/www.searchberg.com\/personal-reputation-management.html\">build a personal reputation<\/a> but merely 5 minutes to ruin it.<\/p>\n<p>Simply put, upholding a positive image of yourself can be a daunting challenge, especially when you and your actions become associated with the value of your business. However, there’s nothing more rewarding than being able to build a stellar name in the industry where everyone loves and respects you.<\/p>\n<p>So how do you do it?<\/p>\n<p>Here are some reputation management tips from us that you can incorporate into your journey to entrepreneurial stardom:<\/p>\n<h2>1. Foster Personal Integrity<\/h2>\n<p>Personal reputation is often rooted in ideas of honesty and righteousness. A morally sound individual is also seen as socially responsible—someone who won’t <a href=\"https:\/\/www.thoughtco.com\/martha-stewarts-insider-trading-case-1146196\">deceive the public<\/a> to grow their business. As such, an entrepreneur’s reputation must be built on integrity.<\/p>\n<p>Integrity comes from a long track record of actions based on positive intent. Now, intent is something that’s hard to catch with the eye, but when you practice what you preach, you’re gaining your peers’ respect automatically.<\/p>\n<p>For example, if you’re someone who believes education is the most important factor in determining a leader’s success, you must have made some strides in the world of academia or have had gone out of your way to pursue education to show that you believe in what you say.<\/p>\n<p>Someone with integrity has the advantage of bouncing back from their mistakes because the world sees you them as someone who’s inherently good at heart.<\/p>\n<h2>2. Don’t Lose Character<\/h2>\n<p>As your business begins to soar in popularity, you’re eventually going to lose reign over how the public perceives you. Entrepreneurs tend to lose control over their personal public image because now the media has the power to manipulate stories for and against you. This could spell trouble even for the most sincere and responsible business personalities.<\/p>\n<p>Although it’s nearly impossible to control what the media says about you, you can most definitely control what you say and do. Unrelenting grace in the face of opposition can withstand the test of time and win you considerable public support over time.<\/p>\n<p>Either way, it’s always best to keep your composure for the sake of your business and the employees who are counting on you to uphold the brand’s image.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1314\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2019\/10\/2-1.jpg\" alt=\"\" width=\"750\" height=\"483\" \/><\/p>\n<h2>3. Regulate Your Online Presence<\/h2>\n<p>Today’s entrepreneurs have the chance to curate their own personal brand and market it to far-reaching audiences. Working with social media can be a bit tricky because there’s just so much information circulating out there, but the good thing is that you can always control what side of you the online world will see.<\/p>\n<p>From press releases to Google My Business posts, you can hire <a href=\"https:\/\/www.searchberg.com\/seo-services.html\">professional SEO marketing services<\/a> to manage your online presence effectively. At Search Berg, we help businesses and individuals manage their online reputation, so they have a degree of control over search engine results against their name.<\/p>\n<p>We believe blogs are a great way to show the public what you and your business are all about. They also help you develop a well thought out message that stays in line with your core values. You can talk about your opinions and allow your readers to communicate with you, creating room for an organic relationship with your clients. It’s also a fantastic way to get more referrals because each time an individual links back to your blog, your page goes up the Google SEO rankings.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1317\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2019\/10\/b1-1.jpg\" alt=\"\" width=\"750\" height=\"156\" \/><\/p>\n<p>Some business owners prefer to create a personal website that gives the public an inside look into how the company is run. These sites usually comprise of the owner’s biography, blog links, contact details, speaker profile and images. Having such online accounts with lots of information and images linked to you, is a great way to push down any negative online comments or reviews associated with your name.<\/p>\n<h2>4. Be Transparent in Your Communication<\/h2>\n<p>Since we’re on the topic of online reputation management, let’s talk a bit about social media. Your personal and business accounts on Facebook, LinkedIn and Twitter are all highly convenient ways to communicate with your audience. It’s so direct and immediate, without room for any filters or message manipulation. Use it wisely. Sign up for some <a href=\"https:\/\/www.searchberg.com\/social-media-marketing.html\">professional social media management<\/a> if you need to.<\/p>\n<p>The purpose of having social media accounts for your business is to be able to keep your employees, clients and critics informed about on-going activities. Ask them for their feedback and be very transparent in your statements so you can forge a loyal support system in times of distress.<\/p>\n<p>Whenever businesses encounter trouble such as internal disputes, rumors spread like wildfire. Clear up the air through a message from your social media accounts before things get out of hand.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1318\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2019\/10\/b2-1.jpg\" alt=\"\" width=\"750\" height=\"156\" \/><\/p>\n<h2>5. Hold Yourself Accountable<\/h2>\n<p>Making mistakes is human but it’s important that you don’t dwell on them. It’s unrealistic to assume that you’re going to have a botch-free career. It’s quite commonplace for executives to place the blame for their mistakes on subordinate employees in a desperate bid to evade negative press.<\/p>\n<p>However—and this may seem counterintuitive, but hear us out—taking ownership for mistakes and holding yourself accountable to your wrongdoings is going to play out massively in your favor. You don’t have to take our word for it. History has proven countless times how accountability can help businesses save face.<\/p>\n<p>Remember the <a href=\"https:\/\/www.wsj.com\/articles\/SB124709897531615407\">Tylenol pills episode with Johnson&amp;Johnson<\/a>? The company owned up to the allegations that its painkiller isn’t safe and called back all associated products. It even took down advertisements for the painkiller and promised the public that they would research and improve the product before thinking about re-releasing it. Although the damage had already been done, Johnson&amp;Johnson was able to safeguard its reputation successfully by acting fast and owning up to its mistakes.<\/p>\n<p>As the CEO or chairperson of your business, you’re likely going to get the short end of the stick, but the public will appreciate you working hard to address your problems.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1315\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2019\/10\/3-1.jpg\" alt=\"Hold Yourself Accountable\" width=\"750\" height=\"483\" \/><\/p>\n<h2>6. Take Inspiration from Others<\/h2>\n<p>If you idolize someone with a reputation of being morally sound, such as Bill Gates, then it’ll help to take a closer look at how they built their personal brand.<\/p>\n<p>In the case of Bill Gates, <a href=\"https:\/\/www.businessinsider.com\/biggest-projects-of-generous-philanthropists-bill-and-melinda-gates-2018-8\">philanthropy<\/a><a href=\"https:\/\/www.businessinsider.com\/biggest-projects-of-generous-philanthropists-bill-and-melinda-gates-2018-8\"> and the support for academic research<\/a> has won him the admiration of millions around the world. This appreciation has also won him loyal customers for Microsoft.<\/p>\n<p>This is probably why socially conscientious initiatives in the name of corporate social responsibility are so important for small and medium-sized businesses.<\/p>\n<h2>7. Use Your Opportunities Wisely<\/h2>\n<p>When your business begins rising in popularity and garners more public attention than it used to, it’s expected to deal with the unexpected. You could be sitting through an interview or press conference when a heckler decides to berate you. Perhaps, an audience member on a radio show decides to criticize you and your business brazenly. Although, this comes off as a sticky situation that no entrepreneur wants to deal with—it’s also a crucial opportunity to impress your peers with your grit and grace.<\/p>\n<p>When you come across similar online backlash, it’s important for you to address the situation, instead of ignoring it. Try to make your argument convincing enough to win the support of your detractors and never respond unkindly. It’ll reflect worse on you than it will on the opposition.<\/p>\n<h2>8. Let the Haters Hate<\/h2>\n<p>No matter how convincing your argument is, you can’t please everyone. Sometimes it pays off to take the high road. Don’t get bogged down with negative comments on your posts. Use them to become more aware of public opinion about you and your business. If there’s something that needs fixing, you can work diligently on that.<\/p>\n<p>Search Berg can always help you with some <a href=\"https:\/\/www.searchberg.com\/reputation-management.html\">professional reputation management services<\/a>! Eventually, you’ll be able to drown the handful of hateful comments in a sea of praise and appreciation.<\/p>\n<h2>9. Don’t Shy Away from Self-Promotions<\/h2>\n<p>If and when you’ve got to a point where your brand image is largely positive, it’s time to keep going! There’s no slacking off when it comes to reputation management. Build a bigger network; get in touch with journalists and producers that can work with you on special marketing projects. It’s all about being able to pitch your vision to the world without coming off as too sales-y.<\/p>\n<p>Media and press releases are especially effective for businesses when they’ve garnered a significant reputation in their local industry. Use them to make important announcements or give updates on the release of new products and services. Although, word of caution: it’s important to be able to structure your press releases a certain way, so they don’t come off as a desperate marketing effort.<\/p>\n<p>Get in touch with our team, and we can help you prepare professional press releases in no time!<\/p>\n<h2>10. Network Your Heart Out<\/h2>\n<p>A positive reputation and personal brand can only go so far with self-promotions. Couple them with some solid recommendations from your peers. When you network with businesses in your local industry or state, it allows you to reach out to a bigger audience. You can write guest posts for your reputable peers or collaborate with them on a project so some of their positive branding can brush off on you.<\/p>\n<p>You can also work on link building to boost your online reputation.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1316\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2019\/10\/4.jpg\" alt=\"work on link building to boost your online reputation\" width=\"750\" height=\"483\" \/><\/p>\n<h2>Want Professional Reputation Management Services?<\/h2>\n<p>Give us a call at 855-444-4777 or <a href=\"https:\/\/www.searchberg.com\/contact-us.html\">write to us here<\/a>. Begin your journey to success with the leading SEO marketing and online reputation management agency in the country!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When it comes to reputation management, companies and entrepreneurs will do anything to save face in times of trouble, even if that means lying. However, there are better ways to tackle the mess. Understanding Personal Reputation Building The era of social media has enabled businesses to become more communicative and transparent regarding their operations. In [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":1313,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[31,15],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>10 Ways to Build a Strong Personal Reputation For Individuals and Entrepreneurs<\/title>\n<meta name=\"description\" content=\"When it comes to reputation management, companies and entrepreneurs will do anything to save face in times of trouble, even if that means lying. However, there are better ways to tackle the mess.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.searchberg.com\/blog\/10-ways-to-build-a-strong-personal-reputation-for-individuals-and-entrepreneurs\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"10 Ways to Build a Strong Personal Reputation For Individuals and Entrepreneurs\" \/>\n<meta property=\"og:description\" content=\"When it comes to reputation management, companies and entrepreneurs will do anything to save face in times of trouble, even if that means lying. However, there are better ways to tackle the mess.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.searchberg.com\/blog\/10-ways-to-build-a-strong-personal-reputation-for-individuals-and-entrepreneurs\/\" \/>\n<meta property=\"og:site_name\" content=\"Search Berg\" \/>\n<meta property=\"article:published_time\" content=\"2019-10-07T15:24:45+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2019\/10\/featured-image-1-1.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"750\" \/>\n\t<meta property=\"og:image:height\" content=\"544\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jonathan Mears\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/#website\",\"url\":\"https:\/\/www.searchberg.com\/blog\/\",\"name\":\"Search Berg\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.searchberg.com\/blog\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/10-ways-to-build-a-strong-personal-reputation-for-individuals-and-entrepreneurs\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2019\/10\/featured-image-1-1.jpg\",\"contentUrl\":\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2019\/10\/featured-image-1-1.jpg\",\"width\":750,\"height\":544,\"caption\":\"uphold the brand\\u2019s image\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/10-ways-to-build-a-strong-personal-reputation-for-individuals-and-entrepreneurs\/#webpage\",\"url\":\"https:\/\/www.searchberg.com\/blog\/10-ways-to-build-a-strong-personal-reputation-for-individuals-and-entrepreneurs\/\",\"name\":\"10 Ways to Build a Strong Personal Reputation For Individuals and Entrepreneurs\",\"isPartOf\":{\"@id\":\"https:\/\/www.searchberg.com\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.searchberg.com\/blog\/10-ways-to-build-a-strong-personal-reputation-for-individuals-and-entrepreneurs\/#primaryimage\"},\"datePublished\":\"2019-10-07T15:24:45+00:00\",\"dateModified\":\"2019-10-07T15:24:45+00:00\",\"author\":{\"@id\":\"https:\/\/www.searchberg.com\/blog\/#\/schema\/person\/8f91fb3ab0a7618b7b69a13da9df3aff\"},\"description\":\"When it comes to reputation management, companies and entrepreneurs will do anything to save face in times of trouble, even if that means lying. However, there are better ways to tackle the mess.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.searchberg.com\/blog\/10-ways-to-build-a-strong-personal-reputation-for-individuals-and-entrepreneurs\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.searchberg.com\/blog\/10-ways-to-build-a-strong-personal-reputation-for-individuals-and-entrepreneurs\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/10-ways-to-build-a-strong-personal-reputation-for-individuals-and-entrepreneurs\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.searchberg.com\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"10 Ways to Build a Strong Personal Reputation For Individuals and Entrepreneurs\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/#\/schema\/person\/8f91fb3ab0a7618b7b69a13da9df3aff\",\"name\":\"Jonathan Mears\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/?s=96&d=mm&r=g\",\"caption\":\"Jonathan Mears\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"10 Ways to Build a Strong Personal Reputation For Individuals and Entrepreneurs","description":"When it comes to reputation management, companies and entrepreneurs will do anything to save face in times of trouble, even if that means lying. However, there are better ways to tackle the mess.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.searchberg.com\/blog\/10-ways-to-build-a-strong-personal-reputation-for-individuals-and-entrepreneurs\/","og_locale":"en_US","og_type":"article","og_title":"10 Ways to Build a Strong Personal Reputation For Individuals and Entrepreneurs","og_description":"When it comes to reputation management, companies and entrepreneurs will do anything to save face in times of trouble, even if that means lying. However, there are better ways to tackle the mess.","og_url":"https:\/\/www.searchberg.com\/blog\/10-ways-to-build-a-strong-personal-reputation-for-individuals-and-entrepreneurs\/","og_site_name":"Search Berg","article_published_time":"2019-10-07T15:24:45+00:00","og_image":[{"width":750,"height":544,"url":"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2019\/10\/featured-image-1-1.jpg","path":"\/home\/searchberg\/public_html\/blog\/wp-content\/uploads\/2019\/10\/featured-image-1-1.jpg","size":"full","id":1313,"alt":"uphold the brand’s image","pixels":408000,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"Jonathan Mears","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.searchberg.com\/blog\/#website","url":"https:\/\/www.searchberg.com\/blog\/","name":"Search Berg","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.searchberg.com\/blog\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.searchberg.com\/blog\/10-ways-to-build-a-strong-personal-reputation-for-individuals-and-entrepreneurs\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2019\/10\/featured-image-1-1.jpg","contentUrl":"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2019\/10\/featured-image-1-1.jpg","width":750,"height":544,"caption":"uphold the brand’s image"},{"@type":"WebPage","@id":"https:\/\/www.searchberg.com\/blog\/10-ways-to-build-a-strong-personal-reputation-for-individuals-and-entrepreneurs\/#webpage","url":"https:\/\/www.searchberg.com\/blog\/10-ways-to-build-a-strong-personal-reputation-for-individuals-and-entrepreneurs\/","name":"10 Ways to Build a Strong Personal Reputation For Individuals and Entrepreneurs","isPartOf":{"@id":"https:\/\/www.searchberg.com\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.searchberg.com\/blog\/10-ways-to-build-a-strong-personal-reputation-for-individuals-and-entrepreneurs\/#primaryimage"},"datePublished":"2019-10-07T15:24:45+00:00","dateModified":"2019-10-07T15:24:45+00:00","author":{"@id":"https:\/\/www.searchberg.com\/blog\/#\/schema\/person\/8f91fb3ab0a7618b7b69a13da9df3aff"},"description":"When it comes to reputation management, companies and entrepreneurs will do anything to save face in times of trouble, even if that means lying. However, there are better ways to tackle the mess.","breadcrumb":{"@id":"https:\/\/www.searchberg.com\/blog\/10-ways-to-build-a-strong-personal-reputation-for-individuals-and-entrepreneurs\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.searchberg.com\/blog\/10-ways-to-build-a-strong-personal-reputation-for-individuals-and-entrepreneurs\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.searchberg.com\/blog\/10-ways-to-build-a-strong-personal-reputation-for-individuals-and-entrepreneurs\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.searchberg.com\/blog\/"},{"@type":"ListItem","position":2,"name":"10 Ways to Build a Strong Personal Reputation For Individuals and Entrepreneurs"}]},{"@type":"Person","@id":"https:\/\/www.searchberg.com\/blog\/#\/schema\/person\/8f91fb3ab0a7618b7b69a13da9df3aff","name":"Jonathan Mears","image":{"@type":"ImageObject","@id":"https:\/\/www.searchberg.com\/blog\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/?s=96&d=mm&r=g","caption":"Jonathan Mears"}}]}},"_links":{"self":[{"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/posts\/1310"}],"collection":[{"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/comments?post=1310"}],"version-history":[{"count":0,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/posts\/1310\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/media\/1313"}],"wp:attachment":[{"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/media?parent=1310"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/categories?post=1310"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/tags?post=1310"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}