{"id":1365,"date":"2019-10-24T09:41:47","date_gmt":"2019-10-24T09:41:47","guid":{"rendered":"https:\/\/www.searchberg.com\/blog\/?p=1365"},"modified":"2019-10-24T09:41:47","modified_gmt":"2019-10-24T09:41:47","slug":"11-ways-to-triple-your-b2b-ecommerce-conversions","status":"publish","type":"post","link":"https:\/\/www.searchberg.com\/blog\/11-ways-to-triple-your-b2b-ecommerce-conversions\/","title":{"rendered":"11 Ways to Triple Your B2B Ecommerce Conversions"},"content":{"rendered":"<p>The B2B market is growing exponentially! <a href=\"https:\/\/www.forrester.com\/report\/US+B2B+eCommerce+Will+Hit+12+Trillion+By+2021\/-\/E-RES136173\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Forrester<\/a> reports that B2B ecommerce sites in the US are estimated to reach $1.8 trillion by 2023.<\/p>\n<p>But let’s face it: a lot goes into launching and building an ecommerce business.<\/p>\n<p>Once set up, you can increase your B2B conversion rates by helping your buyers find what they’re looking for in a seamless manner.<\/p>\n<p>However, this is easier said than done; there are some hidden factors that contribute to your conversion goals:<\/p>\n<ol>\n<li>Email signups<\/li>\n<li>Social media shares<\/li>\n<li>A profitable online sale<\/li>\n<li>Visitors adding products to their carts<\/li>\n<li>Visitors adding products to their wish list<\/li>\n<li>KPIs that are valuable for your company<\/li>\n<li>Let Customers review the products you sell them<\/li>\n<\/ol>\n<h2>Understanding ecommerce conversion rates<\/h2>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1375\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2019\/10\/Understanding-ecommerce-conversion-rates.jpg\" alt=\"\" width=\"1200\" height=\"250\" \/><\/p>\n<p>The ecommerce conversion rate is the percentage of users that visit your website and complete a desired action.<\/p>\n<p>So, what’s a good conversion rate?<\/p>\n<p>The <a href=\"http:\/\/monetate.com\/research\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Monetate Ecommerce Quarterly<\/a> regularly updates the benchmarks on ecommerce conversions for large brands. From this data, we can deduce that the average ecommerce conversion rate is somewhere between 2 and 4%.<\/p>\n<p>Let’s look at 10 ways you can increase your ecommerce conversions:<\/p>\n<h2>1. Improve your analytics<\/h2>\n<p>Analytics that are in tune with your business goals give you real insight into your customers’ buying behavior and point out the improvements that you need to make in your Conversion Rate Optimization (CRO) strategy.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1369\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2019\/10\/analysis-1841158_960_720.jpg\" alt=\"Improve your analytics\" width=\"960\" height=\"640\" \/><\/p>\n<p>High-tier brands know what their top selling commodities are, and when it’s high-time to remarket them.<\/p>\n<p>Your B2B firm is no different.<\/p>\n<p>When you fix your analytics to properly track your goals, you’ll be able to map out the journey of top customers and learn how likely are customers to go through your products.<\/p>\n<p>For instance, find out what people are looking for when they visit your site, including specific categories, product pages and information pages.<\/p>\n<p>Constructing customer journey is an essential and integral part of <u><a href=\"https:\/\/www.searchberg.com\/ecommerce-seo.html\">B2B ecommerce SEO Services and marketing<\/a><\/u>, which in turn translates into higher conversions.<\/p>\n<p>Without having access to the trigger events, scenarios and unified data source that synchronizes offline sales with the online activity, your B2B business will not be able to reach its potential.<\/p>\n<p>Your digital plan should primarily include the concept of storing customer data and acting upon it in real-time.<\/p>\n<p>You can even tweak your analytics by segmenting the traffic to track repeat purchasers and for insights into the events leading to a purchase.<\/p>\n<h2>2. Mobile Optimization<\/h2>\n<p><u><a href=\"https:\/\/www.statista.com\/statistics\/330695\/number-of-smartphone-users-worldwide\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Studies<\/a><\/u> show that the number of smartphone users worldwide surpasses the three million mark, and this figure is forecasted to further increase by several hundred million in the upcoming years. This gives way to the increasing trend of mobile shopping.<\/p>\n<p>Mobile conversion rates can take a massive hit if ecommerce businesses don’t follow the best practices of mobile landing pages. In fact, a <u><a href=\"https:\/\/www.thinkwithgoogle.com\/data\/cpg-shoppers-smartphone-purchase\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">study<\/a><\/u> has shown that 67% of smartphone users are likely to purchase from businesses with content customized according to their location.<\/p>\n<p>To optimize for mobile devices, it is very important to keep your text concise, to the point, and also impactful.<\/p>\n<p>You need to hit the customer&#8217;s pain points and benefits right on the bull&#8217;s eye. This will significantly improve and increase your b2b conversions rate via your mobile website.<\/p>\n<p>You can do this by writing essentials-only product descriptions and copy. On a mobile phone, a person is scrolling and therefore has a more limited screen size and attention span.<\/p>\n<p>No one likes to read pointless fluff, especially mobile users.<\/p>\n<p>Another important note to optimize your ecommerce site for mobile users is speed. To figure out whether your website is currently optimized for speed on mobile devices, you can use Google&#8217;s Pagespeed Insights <a href=\"https:\/\/developers.google.com\/speed\/pagespeed\/insights\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">tool<\/a>.<\/p>\n<p>The tool will then spit out firstly what speed your users are experiencing when using your site and secondly what you should change in order to improve their experience.<\/p>\n<p>Making sure your speed is fast in this way optimizes your customer experience, which in turn, massively improves your b2b website conversion rate.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1370\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2019\/10\/device-digital-ecommerce-35550.jpg\" alt=\"Mobile Optimization\" width=\"1280\" height=\"853\" \/><\/p>\n<p>As illustrated, mobile site’s performance plays a major role in the success of any online venture.<\/p>\n<p>By providing your customers with a fast and seamless mobile experience, enhanced merchandizing and auto complete features, you’ll quickly see the web conversions and revenue increase significantly.<\/p>\n<p><u><a href=\"https:\/\/www.nngroup.com\/articles\/how-long-do-users-stay-on-web-pages\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Research<\/a><\/u> shows that 47% of the visitors expect the website to load in less than 2 seconds. Conversely, 40% visitors are likely to leave the site if the load time is more than 3 seconds.<\/p>\n<p>So remember to plug your URL into <u><a href=\"https:\/\/developers.google.com\/speed\/pagespeed\/insights\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Google’s PageSpeed Insights<\/a><\/u> to make sure your site’s load time is within these parameters and if it&#8217;s not, make the recommended changes to boost your b2b conversion rate.<\/p>\n<h2>3. Give clear and detailed product descriptions<\/h2>\n<p>Once you’ve captured your visitor’s attention, it’s time to keep them engaged. That’s where product page optimization comes in. You can drive high levels of B2B online sales by adding unique content to your site that speaks to the challenges of your customers. Always add as much information as you can about the product; visitors bounce from pages that aren’t able to answer their questions. This includes the products’ features, benefits, how it works, and what it can and cannot do.<\/p>\n<p><u><a href=\"https:\/\/www.salesforce.com\/blog\/2016\/06\/selling-to-the-modern-b2b-buyer.html\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Salesforce reports<\/a><\/u> that nearly 59% of all B2B buyers conduct online research on the products that they require, instead of contacting a customer service.<\/p>\n<p>You should also try to include a product reviews section into your site to enhance your B2B ecommerce experience. Doing so creates the “Amazon Effect”, which reinforces positive feelings in your buyers.<\/p>\n<p>Be sure to integrate the cross sell and upsell functionalities in the website’s initial presentation as well as the order confirmation stage—the website should speak to the visitors in a way that complements the products that they’re about to purchase.<\/p>\n<h2>4. Consider adding a product video\/demonstration<\/h2>\n<p>Images are great, but videos are better. Adding a product video will go hand-in-hand with the product description. Since your site isn’t a brick and mortar store where visitors can talk directly to representatives and ask them questions, your aim should be to provide a digital experience that’s as close to the real deal as possible.<\/p>\n<p>Provide a clear walk through of how to set up the product and its use through a demo video. Customers prefer to assess the ease of using the product.<\/p>\n<h2>5. Product filtering and site search<\/h2>\n<p>Setting your site with powerful characterization and filtering will help your customers find exactly what they’re looking for. For instance, give visitors the ability to filter products by price, size, color or style. Going through a long list of products without categories would be chaotic!<\/p>\n<p>Moreover, in case you offer services instead of products, make sure your services are clearly listed in a structured product menu. You can even add a ‘Suggested Products’ functionality that will increase your cross-selling and upselling opportunities.<\/p>\n<h2><strong>6. Provide free shipping<\/strong><\/h2>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1371\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2019\/10\/free-shipping-with-aeroplane.jpg\" alt=\"Provide free shipping\" width=\"816\" height=\"816\" \/><\/p>\n<p>Statistics show that nearly <u><a href=\"http:\/\/techcrunch.com\/2011\/05\/17\/almost-half-of-all-online-orders-now-include-free-shipping\/https:\/nrf.com\/media-center\/press-releases\/nrf-study-says-more-online-shoppers-want-free-shipping\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">75% of consumers<\/a><\/u> expect free shipping—even if their orders are under $50. Amazon’s Prime membership is based entirely on consumers’ obsession with free shipping. This is a pretty smart strategy. <u><a href=\"https:\/\/www.theatlantic.com\/technology\/archive\/2018\/04\/free-shipping-isnt-hurting-amazon\/559052\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Analysts<\/a><\/u> believe that Amazon is trying to get the customers hooked on the convenience of free shipping; once customers get their Prime ID, they start buying everything without really paying attention to the prices.<\/p>\n<p>What’s more is that an <u><a href=\"https:\/\/conversionxl.com\/blog\/shopping-cart-abandonment-how-to-recover-baskets-of-money\/#.\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">average of 67.75%<\/a><\/u> shopping carts are abandoned due to unexpected costs like shipping and taxes.<\/p>\n<p>A psychology hack for this that you could implement is to make it look like you&#8217;re offering free shipping when your shipping cost is actually included in your overall cost, which technically allows you to say free shipping in your product pricing section.<\/p>\n<p>Here&#8217;s an example of this.<\/p>\n<p>Say you have one product, which is $30 + $5 shipping.<\/p>\n<p>A customer will not like the idea of paying $5 extra for shipping. Instead, if you simply wrote:<\/p>\n<p>$35 + free shipping<\/p>\n<p>The same customer is much more likely to make invest in your product.<\/p>\n<p>It can be funny to see because you are getting the same amount of money, either way, you phrase it, but it&#8217;s a common practice among marketers and business people to take advantage of this interesting quirk in the human psyche and buyer mentality.<\/p>\n<p>Ultimately this simple psychology hack can help you boost your b2b conversions by changing almost nothing on your site but how your pricing is phrased.<\/p>\n<p>&nbsp;<\/p>\n<h2>7. User Personalization<\/h2>\n<p>According to <u><a href=\"https:\/\/www.smartinsights.com\/ecommerce\/web-personalisation\/types-ecommerce-personalisation\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Smart Insights<\/a><\/u>, adding suggestive personalization in your website—for instance, “visitors who viewed this, also viewed”—can generate up to 68% of your ecommerce revenue.<\/p>\n<p>Amazon.com is a clear example of user personalization in ecommerce marketing sites. Nearly every element on their page is personalized; from the personal hello to the “Wish List” and suggested items based on the visitor’s previous searches—nothing is recommended to the user outside their realm of interests.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1372\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2019\/10\/Untitled-1.jpg\" alt=\"personalization in ecommerce marketing\" width=\"624\" height=\"416\" \/><\/p>\n<p>Additionally, you can increase B2B conversion rates by giving your customers star treatment through a personalized dashboard that displays relevant products, their recent orders and timely promotions. It can even offer additional rewards like early product availability, custom pricing, enhanced customer service and invoicing options.<\/p>\n<h2>8. Use chatbots or live chat<\/h2>\n<p>Using chatbots will help you avoid the overhead of staffing someone for live chat, but in reality you’ll get a better response from visitors if you use live chat. This is because buyers are always looking for a personalized customer experience, just as they would expect from a brick and mortar store. Plus, it builds a direct communication line between you and your potential customer.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1373\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2019\/10\/chatbot-3589528_1280.jpg\" alt=\"Using chatbots\" width=\"1280\" height=\"1106\" \/><\/p>\n<p>B2B stores can gain the customers’ trust and prove that a real expert is on the other end by displaying an actual photo, name, contact number, ratings and the number of customers that have been served.<\/p>\n<p>In case you do opt for the chatbot route, be upfront with your customers about it. A prime example is Facebook’s chatbot ‘<a href=\"https:\/\/www.chatbots.org\/chatbot\/bitcoin_buddy\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Bitcoin Buddy<\/a>.’<\/p>\n<h2>9. Obtain customer emails<\/h2>\n<p>Try to access your customer’s email addresses through a coupon code or a pop-up, and market your best selling products to the customer while they’re still in their decision phase.<\/p>\n<p>One such example is <a href=\"https:\/\/www.zappos.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Zappo’s<\/a> rewards program that offers free shipping and exclusive 24\/7 customer service access upon sign up.<\/p>\n<p>Email marketing is a practice that every B2B ecommerce business should adopt because people—business executives in particular—constantly check their email. In fact, studies show that email marketing generates <u><a href=\"https:\/\/www.campaignmonitor.com\/resources\/guides\/email-marketing-new-rules\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">40 times more ROI<\/a><\/u> compared to other marketing tactics.<\/p>\n<p>An email campaign should focus on addressing the pains of the customers and informing them of what the brand’s services are, how they work, and what challenges they aim to solve.<\/p>\n<h2>10. Offer coupons<\/h2>\n<p>Coupons can be a great way to gain your visitor’s interest and encourage them to try your services and products out. However, make sure to use coupons sparingly, because offering low prices all the time can end up hurting your business.<\/p>\n<p>For instance, offering 50% discount on too many services can cut your revenue in half. Although it may attract new customers but that still doesn’t guarantee repeat business. How many times did you end up buying a product only because it was discounted?<\/p>\n<p>Instead, focus on offering a unique brand experience and an outstanding service.<\/p>\n<p>Here are some ingenious ways of using coupons to boost revenue:<\/p>\n<h2>Sell “stale” inventory<\/h2>\n<p>Introduce coupons when you notice low sales volumes. Either offer a percentage discount on individual items in the inventory or offer a free item once the buyer hits a certain spending threshold.<\/p>\n<h2>Appreciating customers<\/h2>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1374\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2019\/10\/Appreciating-customers.jpg\" alt=\"\" width=\"1200\" height=\"250\" \/><\/p>\n<p>That’s all the more reason to show your loyal customers some love! Email your customers coupon codes to thank them for their continued support.<\/p>\n<p>Reward new customers with discounts.<\/p>\n<p>When a new customer purchases from your business for the first time, you can automatically apply discounts on their order. Although try not to sell this upfront; little bonuses like discounts that apply at checkouts may be a great tactic to making lifetime customers.<\/p>\n<h2>11. Let your customers leave reviews for the products they buy from you.<\/h2>\n<p>Reviews are incredibly important, not just for you as a business owner and seller to know that you are, in fact, selling good products that actually do help people, but also for your future customers.<\/p>\n<p>This is people&#8217;s hard-earned money, so naturally, they will want to check out your page to see what other users of the product had to say about it upon receiving it.<\/p>\n<p>Good product reviews mean a more confident buyer, which translates into skyrocketing your conversion rate for your b2b ecommerce website.<\/p>\n<p>So let your customers leave reviews within your product page itself and, in fact, encourage them to leave reviews.<\/p>\n<p>A best practice related to reviews is to display your top reviews to potential customers who are scrolling through the product page. Yet another best practice to boost your conversion and customer retention rate is to actually take the time to as a seller respond to each of your customers&#8217; reviews, whether they are good or bad.<\/p>\n<p>If they are good, be sure to express your gratitude, thank them, and mention that you look forward to helping them find success with their pain points in the future.<\/p>\n<p>The more personalized rather than generic the response, the better.<\/p>\n<p>The same principle applies to negative reviews. Be gracious and accept feedback where it makes sense.<\/p>\n<p>One thing you want to highlight in your top reviews is how your company works and what your unique selling point is to fellow businesses that you are selling to.<\/p>\n<p>The way you can do this is by approaching previous clients and asking them specifically how your business has made a solid and helpful impact on their business to even help them improve their workflow\/conversion rate, depending on the nature of their business.<\/p>\n<p>Another hack that is arguably even a step up from top reviews is to take advantage of the power of a testimonial.<\/p>\n<p>Testimonials are particularly powerful because they tend to be more detailed than a regular review would be because the person essentially swears by your product enough to give you a testimonial.<\/p>\n<p>In this way, video testimonials are particularly powerful and impactful to consumers because video just acts as more solid social proof to a fellow customer than writing a review would.<\/p>\n<p>A person can see that another person has needs similar to theirs&#8217;, which were met by your product on your b2b website.<\/p>\n<p>Therefore, seeing this testimonial would increase their confidence in their purchasing decision and subsequently increase your b2b web conversion rate as a whole.<\/p>\n<h2>In conclusion<\/h2>\n<p>There isn’t a “one size fits all” strategy when it comes to how to best boost your B2B ecommerce conversions. The goal should be to implement these tactics intelligently. Showcase your brand’s distinctive features, use Artificial intelligence, a dynamic pricing business model and offer unique packages to new and repeat customers.<\/p>\n<p>If you’re able to get happy customers to sign up to your referral program and leave positive reviews, you’ll be amazed at the impact it has on your ROI.<\/p>\n<p><strong>Bio: <\/strong>The author is a digital marketing and SEO expert at Search Berg, an <u><a href=\"https:\/\/www.searchberg.com\/\">award-winning digital marketing firm<\/a><\/u>. He specializes in on-page SEO, <u><a href=\"https:\/\/www.searchberg.com\/link-building-service.html\">link building<\/a><\/u> and SEO ecommerce services and marketing solutions.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The B2B market is growing exponentially! Forrester reports that B2B ecommerce sites in the US are estimated to reach $1.8 trillion by 2023. But let’s face it: a lot goes into launching and building an ecommerce business. Once set up, you can increase your B2B conversion rates by helping your buyers find what they’re looking for in [&hellip;]<\/p>\n","protected":false},"author":8,"featured_media":1368,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[35,33],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>11 Ways to Triple Your B2B Ecommerce Conversions<\/title>\n<meta name=\"description\" content=\"The ecommerce conversion rate is the percentage of users that visit your website and complete a desired action.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.searchberg.com\/blog\/11-ways-to-triple-your-b2b-ecommerce-conversions\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"11 Ways to Triple Your B2B Ecommerce Conversions\" \/>\n<meta property=\"og:description\" content=\"The ecommerce conversion rate is the percentage of users that visit your website and complete a desired action.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.searchberg.com\/blog\/11-ways-to-triple-your-b2b-ecommerce-conversions\/\" \/>\n<meta property=\"og:site_name\" content=\"Search Berg\" \/>\n<meta property=\"article:published_time\" content=\"2019-10-24T09:41:47+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2019\/10\/SB_Blog_10WaystoTripleYourB2BEcommerceConversions-1.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"750\" \/>\n\t<meta property=\"og:image:height\" content=\"544\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Ryan Fernandez\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"13 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/#website\",\"url\":\"https:\/\/www.searchberg.com\/blog\/\",\"name\":\"Search Berg\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.searchberg.com\/blog\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/11-ways-to-triple-your-b2b-ecommerce-conversions\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2019\/10\/SB_Blog_10WaystoTripleYourB2BEcommerceConversions-1.jpg\",\"contentUrl\":\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2019\/10\/SB_Blog_10WaystoTripleYourB2BEcommerceConversions-1.jpg\",\"width\":750,\"height\":544,\"caption\":\"10 Ways to Triple Your B2B Ecommerce Conversions\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/11-ways-to-triple-your-b2b-ecommerce-conversions\/#webpage\",\"url\":\"https:\/\/www.searchberg.com\/blog\/11-ways-to-triple-your-b2b-ecommerce-conversions\/\",\"name\":\"11 Ways to Triple Your B2B Ecommerce Conversions\",\"isPartOf\":{\"@id\":\"https:\/\/www.searchberg.com\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.searchberg.com\/blog\/11-ways-to-triple-your-b2b-ecommerce-conversions\/#primaryimage\"},\"datePublished\":\"2019-10-24T09:41:47+00:00\",\"dateModified\":\"2019-10-24T09:41:47+00:00\",\"author\":{\"@id\":\"https:\/\/www.searchberg.com\/blog\/#\/schema\/person\/8431a63820a50433f46e11dcaf5d1554\"},\"description\":\"The ecommerce conversion rate is the percentage of users that visit your website and complete a desired action.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.searchberg.com\/blog\/11-ways-to-triple-your-b2b-ecommerce-conversions\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.searchberg.com\/blog\/11-ways-to-triple-your-b2b-ecommerce-conversions\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/11-ways-to-triple-your-b2b-ecommerce-conversions\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.searchberg.com\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"11 Ways to Triple Your B2B Ecommerce Conversions\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/#\/schema\/person\/8431a63820a50433f46e11dcaf5d1554\",\"name\":\"Ryan Fernandez\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/?s=96&d=mm&r=g\",\"caption\":\"Ryan Fernandez\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"11 Ways to Triple Your B2B Ecommerce Conversions","description":"The ecommerce conversion rate is the percentage of users that visit your website and complete a desired action.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.searchberg.com\/blog\/11-ways-to-triple-your-b2b-ecommerce-conversions\/","og_locale":"en_US","og_type":"article","og_title":"11 Ways to Triple Your B2B Ecommerce Conversions","og_description":"The ecommerce conversion rate is the percentage of users that visit your website and complete a desired action.","og_url":"https:\/\/www.searchberg.com\/blog\/11-ways-to-triple-your-b2b-ecommerce-conversions\/","og_site_name":"Search Berg","article_published_time":"2019-10-24T09:41:47+00:00","og_image":[{"width":750,"height":544,"url":"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2019\/10\/SB_Blog_10WaystoTripleYourB2BEcommerceConversions-1.jpg","path":"\/home\/searchberg\/public_html\/blog\/wp-content\/uploads\/2019\/10\/SB_Blog_10WaystoTripleYourB2BEcommerceConversions-1.jpg","size":"full","id":1368,"alt":"10 Ways to Triple Your B2B Ecommerce Conversions","pixels":408000,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"Ryan Fernandez","Est. reading time":"13 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.searchberg.com\/blog\/#website","url":"https:\/\/www.searchberg.com\/blog\/","name":"Search Berg","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.searchberg.com\/blog\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.searchberg.com\/blog\/11-ways-to-triple-your-b2b-ecommerce-conversions\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2019\/10\/SB_Blog_10WaystoTripleYourB2BEcommerceConversions-1.jpg","contentUrl":"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2019\/10\/SB_Blog_10WaystoTripleYourB2BEcommerceConversions-1.jpg","width":750,"height":544,"caption":"10 Ways to Triple Your B2B Ecommerce Conversions"},{"@type":"WebPage","@id":"https:\/\/www.searchberg.com\/blog\/11-ways-to-triple-your-b2b-ecommerce-conversions\/#webpage","url":"https:\/\/www.searchberg.com\/blog\/11-ways-to-triple-your-b2b-ecommerce-conversions\/","name":"11 Ways to Triple Your B2B Ecommerce Conversions","isPartOf":{"@id":"https:\/\/www.searchberg.com\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.searchberg.com\/blog\/11-ways-to-triple-your-b2b-ecommerce-conversions\/#primaryimage"},"datePublished":"2019-10-24T09:41:47+00:00","dateModified":"2019-10-24T09:41:47+00:00","author":{"@id":"https:\/\/www.searchberg.com\/blog\/#\/schema\/person\/8431a63820a50433f46e11dcaf5d1554"},"description":"The ecommerce conversion rate is the percentage of users that visit your website and complete a desired action.","breadcrumb":{"@id":"https:\/\/www.searchberg.com\/blog\/11-ways-to-triple-your-b2b-ecommerce-conversions\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.searchberg.com\/blog\/11-ways-to-triple-your-b2b-ecommerce-conversions\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.searchberg.com\/blog\/11-ways-to-triple-your-b2b-ecommerce-conversions\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.searchberg.com\/blog\/"},{"@type":"ListItem","position":2,"name":"11 Ways to Triple Your B2B Ecommerce Conversions"}]},{"@type":"Person","@id":"https:\/\/www.searchberg.com\/blog\/#\/schema\/person\/8431a63820a50433f46e11dcaf5d1554","name":"Ryan Fernandez","image":{"@type":"ImageObject","@id":"https:\/\/www.searchberg.com\/blog\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/?s=96&d=mm&r=g","caption":"Ryan Fernandez"}}]}},"_links":{"self":[{"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/posts\/1365"}],"collection":[{"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/users\/8"}],"replies":[{"embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/comments?post=1365"}],"version-history":[{"count":0,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/posts\/1365\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/media\/1368"}],"wp:attachment":[{"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/media?parent=1365"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/categories?post=1365"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/tags?post=1365"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}