{"id":1499,"date":"2020-05-05T10:41:06","date_gmt":"2020-05-05T10:41:06","guid":{"rendered":"https:\/\/www.searchberg.com\/blog\/?p=1499"},"modified":"2020-05-05T10:41:06","modified_gmt":"2020-05-05T10:41:06","slug":"6-digital-marketing-tips-for-small-businesses-struggling-to-navigate-covid-19","status":"publish","type":"post","link":"https:\/\/www.searchberg.com\/blog\/6-digital-marketing-tips-for-small-businesses-struggling-to-navigate-covid-19\/","title":{"rendered":"8 Digital Marketing Tips &#038; Tricks for Small Businesses Struggling to Navigate COVID-19"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1501\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/pexels-photo-572056.jpeg\" alt=\"\" width=\"1400\" height=\"934\" \/><\/p>\n<p>As the COVID-19 lockdown continues, small businesses <strong>across the globe<\/strong> have been struggling to keep up with <strong>key performance metrics<\/strong>, <strong>engage their audience<\/strong>, and <strong>retain customers<\/strong>.<\/p>\n<p>While these businesses previously relied on <u>local offline marketing strategies<\/u> rather than internet marketing for long-term growth, the new wave of lockdown-induced <em>digitalization<\/em> has made it increasingly difficult to engage with customers without using technology.<\/p>\n<p>According to Forbes, <a rel=\"nofollow noopener noreferrer\" href=\"https:\/\/www.forbes.com\/sites\/briannegarrett\/2020\/03\/20\/small-business-relief-tracker-funding-grants-and-resources-for-business-owners-grappling-with-coronavirus\/#12c74867dd4c\" target=\"_blank\">over 30 million<\/a> small businesses have suffered unprecedented customer attrition and revenue loss. With approximately <a rel=\"nofollow noopener noreferrer\" href=\"https:\/\/www.theguardian.com\/us-news\/2020\/apr\/10\/us-briefing-covid-19-second-wave-fears-as-deaths-rise-jobs-lost\" target=\"_blank\">6.6 million U.S. workers<\/a> losing their jobs each week, nationwide unemployment is rising at alarming rates.<\/p>\n<p>The increasing use of social media and online browsing has necessitated the transition from offline marketing to strong online digital marketing that encompasses PPC marketing, social media marketing, content marketing, web design and development, and reputation management.<\/p>\n<p>There is a dire need for innovation in marketing practices, especially for small businesses, and <strong><u>those who are innovating right now are indeed finding success<\/u><\/strong>.<\/p>\n<p>Small businesses that <a rel=\"nofollow noopener noreferrer\" href=\"https:\/\/www.forbes.com\/sites\/bernardmarr\/2020\/03\/20\/why-companies-turn-to-digital-marketing-to-survive-covid-19\/#5f88c2392425\" target=\"_blank\">leverage the best online marketing<\/a> tips and tricks during 2021 in this ongoing period of uncertainty witness <em>increases<\/em> in <strong>conversion rates<\/strong>, <strong>brand growth<\/strong>, and <strong>revenue<\/strong>.<\/p>\n<p>To help you discover the realm of digital marketing and how you can immediately use it to benefit your small business, we’ve rounded up our <u>top eight Online and Digital Marketing tips<\/u>.<\/p>\n<p>Using these, you can not only climb out of the COVID-19 abyss but have your business <strong>sustain <\/strong>and <strong>thrive <\/strong>both during and following lockdown.<\/p>\n<h2><strong>1. Create an Engaging, Interactive, and User-Friendly Website<\/strong><\/h2>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1504\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/photo-1519222970733-f546218fa6d7.jpg\" alt=\"\" width=\"750\" height=\"500\" \/><\/p>\n<p>The ongoing pandemic has <strong>increased internet use<\/strong> by a whopping <a rel=\"nofollow noopener noreferrer\" href=\"https:\/\/www.forbes.com\/sites\/markbeech\/2020\/03\/25\/covid-19-pushes-up-internet-use-70-streaming-more-than-12-first-figures-reveal\/\" target=\"_blank\">70%<\/a>.<\/p>\n<p>In fact, the surge in web browsing is expected to continue once the lockdown restrictions are eased.<\/p>\n<p>Companies with a strong online presence have leveraged this boost in web traffic and have sustained revenues despite the nationwide lockdown.<\/p>\n<p>However, many small businesses have been apprehensive about transitioning from tried-and-trusted offline marketing strategies to web marketing.<\/p>\n<p>While the change may seem challenging at first, you’ll<strong> immediately<\/strong> notice a boost in audience engagement and retention.<\/p>\n<p>According to research, <a rel=\"nofollow noopener noreferrer\" href=\"https:\/\/clutch.co\/web-designers\/resources\/small-business-2017-website-survey\" target=\"_blank\">over 92%<\/a> of small business owners believe that having a user-friendly, engaging, and interactive website is the <strong>most powerful digital marketing strategy<\/strong> available to them.<\/p>\n<p>The imperativeness of this has doubled over the past few months as the lockdown continues to boost web browsing.<\/p>\n<p>Improve search rankings, local reach, and traffic by creating a comprehensive and fully-customized website. As more people gain easy access to your products and services, your business will expand organically.<\/p>\n<p>Over time, you’ll manage to counteract the damage sustained during the initial months of the lockdown.<\/p>\n<p>Now that you understand the importance of having a solidly engaging, interactive, and user-friendly website, you may be wondering how to go about accomplishing solid digital marketing for your small business&#8217; website.<\/p>\n<p>Here are some best practices for you to follow:<\/p>\n<ol>\n<li>Keep your <strong>layout simple<\/strong>. Figure out what the absolute essentials of your website are and draw focus to that. This helps your website have a <em>&#8220;clean&#8221;<\/em> aesthetic that is also functional.<\/li>\n<\/ol>\n<p>Having a clean and functional approach also helps to reduce your load times and make it easier for users to navigate on multiple devices.<\/p>\n<ol start=\"2\">\n<li>Speaking of multiple devices, make absolutely sure that your website is designed to <strong>work in a mobile and tablet format<\/strong> as well as the traditional desktop format.<\/li>\n<\/ol>\n<p>Not only does this make life far easier for a customer who wants to check out your site on their phone\/tablet, but it also improves your search rankings.<\/p>\n<p>This is because recently, Google has had a <a rel=\"nofollow noopener noreferrer\" href=\"https:\/\/fortune.com\/2015\/04\/21\/google-mobilegeddon\/\" target=\"_blank\">Mobilegeddon<\/a> tweak to its search algorithm. Basically, if your website does not have a mobile-friendly interface, Google will punish your website by reducing your rankings.<\/p>\n<p>So don&#8217;t forget mobile device compatibility because it can make or break your site&#8217;s rankings.<\/p>\n<ol start=\"3\">\n<li>Make your site&#8217;s <strong>navigation features easy to follow<\/strong>.<\/li>\n<\/ol>\n<p>As a business, your goal is to have a customer <em>stay <\/em>on your website.<\/p>\n<p>The way that they stay is by clicking around.<\/p>\n<p>Therefore, since you want them to stay on your site for longer periods, you need to <strong>make the navigation easy<\/strong>.<\/p>\n<ol start=\"4\">\n<li>Make use of <strong>highlighted calls to action<\/strong>.<\/li>\n<\/ol>\n<p>To do this effectively, you need to ask yourself what you want your customer to do when they are on your site. Do you want them to buy products, book a phone call, call your business&#8230;?<\/p>\n<p>Figure out your calls to action and slap them on your site.<\/p>\n<p>Highlight and design them in such a way that the user can&#8217;t miss them without being obnoxiously sales-y. Simple buttons work just fine for this.<\/p>\n<p>In addition to your web pages and outside content, you can also use calls to action <strong>throughout your content<\/strong> when they become relevant.<\/p>\n<ol start=\"5\">\n<li>Lastly, don&#8217;t underestimate the power of <strong>simple, good-looking, <\/strong>and<strong> easy-to-read font<\/strong>.<\/li>\n<\/ol>\n<h2>2. Leverage Social Media for Increased Customer Engagement and Retention<\/h2>\n<p>With a sleek and interactive website, you should take advantage of social media to engage customers and send them to your site.<\/p>\n<p>This is because, according to research, the ongoing lockdown has increased social media use by <a rel=\"nofollow noopener noreferrer\" href=\"https:\/\/www.socialmediatoday.com\/news\/people-are-spending-20-more-time-in-apps-during-the-covid-19-lockdowns-re\/575403\/\" target=\"_blank\">20%<\/a>.<\/p>\n<p>As people transition to working and studying from home, there has been a <a href=\"https:\/\/www.searchberg.com\/blog\/8-reasons-to-protect-your-brands-online-reputation-during-the-covid-19-pandemic\/\">15–40%<\/a> increase in popular social media applications like Facebook, Instagram, and Twitter.<\/p>\n<p>While focusing on powerful web design and development is imperative, it’s equally important to <strong>leverage social media for increased customer engagement and retention<\/strong>.<\/p>\n<p>Here&#8217;s what you can do to establish a strong social media presence:<\/p>\n<ol>\n<li><strong><u>Actively interact<\/u><\/strong> with customers. By doing so, you are building relationships with them. This is key because customers are <em>far more likely to <strong>purchase <\/strong>from a brand they have had a positive social media interaction with. <\/em><\/li>\n<\/ol>\n<p>Helpfulness, kindness, positivity, and a well-phrased joke can go a long way.<\/p>\n<ol start=\"2\">\n<li><strong><u>Optimize your content stream<\/u><\/strong><u>.<\/u> What can help you immensely if you&#8217;ve already been doing <strong>social media for your business<\/strong> is to do an <strong>audit of your content<\/strong>.<\/li>\n<\/ol>\n<p>Use this audit to see what is working, gaining traction, performing well, starting conversations, and building relationships with your customers.<\/p>\n<p>Based on this audit, <strong>do more of what works and less of what doesn&#8217;t work well<\/strong>. Tweak what doesn&#8217;t work and execute new ideas.<\/p>\n<ol start=\"3\">\n<li><strong><u>Use rich images and videos<\/u><\/strong>. Especially during the pandemic, people&#8217;s online appetite for video has increased <a rel=\"nofollow noopener noreferrer\" href=\"https:\/\/www.statista.com\/statistics\/1107559\/video-streaming-consumption-growth-worldwide-coronavirus\/\" target=\"_blank\">immensely<\/a>.<\/li>\n<\/ol>\n<p>You don&#8217;t have to break the bank to make videos and can very much do it yourself.<\/p>\n<p>You can do so by making sure your video content is <u>in line with your business goals\/objectives, keeping it short, writing a script, optimizing messaging, and paying attention to your videos&#8217; analytics.<\/u><\/p>\n<p>We will delve deeper into video marketing later in this blog post.<\/p>\n<ol start=\"4\">\n<li><u>Check out your <strong>competitors<\/strong><\/u>.<\/li>\n<\/ol>\n<p>It&#8217;s definitely frowned upon to copy strategies, but there&#8217;s nothing wrong with <em>looking through<\/em> your competitor&#8217;s posts to see what their strategy is and take inspiration from it.<\/p>\n<p>It might spark some awesome content ideas for your own business and, in turn, help you drive engagement.<\/p>\n<ol start=\"5\">\n<li><strong><u>Set goals and key objectives<\/u><\/strong> for your social media efforts.<\/li>\n<\/ol>\n<p>A great framework for goal setting that is also applicable to goal setting outside of social media is the <strong>SMART framework<\/strong>.<\/p>\n<p>In this, you define your goal by making it specific, measurable, achievable\/realistic, relevant, and time-bound.<\/p>\n<ol start=\"6\">\n<li>Take advantage of <strong><u>&#8220;social media listening.&#8221;<\/u><\/strong><\/li>\n<\/ol>\n<p>Suppose you run a bakery and you go to Twitter. If you look into conversations people are having about your bakery, you might come across some valuable feedback that you might have missed because the customers were saying it to <em>each other<\/em> as opposed to you directly.<\/p>\n<p>This is <strong>social media listening.<\/strong><\/p>\n<p>You now have the opportunity to take the feedback, explore if others feel similarly on social media, and make adjustments to your products (e.g., cake moisture levels) accordingly.<\/p>\n<p>You can do this effectively by <strong><u>monitoring social media platforms actively for mentions of your products, brand, competitors, and even keywords relevant to your business<\/u><\/strong><u>.<\/u><\/p>\n<p>The first step to good communication is to listen carefully.<\/p>\n<p>Not only will this help you redirect customers to your website, but you’ll also notice an increase in direct orders for your products\/services.<\/p>\n<p>Also known as <strong><a rel=\"nofollow noopener noreferrer\" href=\"https:\/\/www.forbes.com\/sites\/propointgraphics\/2016\/08\/07\/what-is-social-selling-and-how-do-you-do-it\/\" target=\"_blank\">social selling<\/a><\/strong>, social media selling helps small businesses boost revenue by doubling or even tripling online transactions. As your brand successfully taps into the digital realm, you’ll manage to generate more leads and expand your business.<\/p>\n<h2>3. Develop an Empathetic and Crisis-Friendly Digital Marketing Approach<\/h2>\n<p>As the COVID-19 pandemic continues, many brands have been called out for <a rel=\"nofollow noopener noreferrer\" href=\"https:\/\/time.com\/5814509\/coronavirus-marketing\/\" target=\"_blank\">insensitive marketing campaigns<\/a>. As small businesses transition to the digital landscape, it’s essential to tread with care and avoid developing an <a rel=\"nofollow noopener noreferrer\" href=\"https:\/\/adage.com\/article\/cmo-strategy\/7-brands-ads-unfortunately-timed-coronavirus-pandemic\/2244631\" target=\"_blank\">excessively promotional<\/a> marketing strategy.<\/p>\n<p>Instead, develop an empathetic and crisis-friendly approach to ensure customers feel comforted, motivated, and inspired during a time of global chaos and uncertainty.<\/p>\n<p>Starbucks’ <strong>thoughtful and empowering<\/strong> posts are a great example of putting your customers first instead of capitalizing on a global pandemic:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1505\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/1.png\" alt=\"\" width=\"490\" height=\"204\" \/><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1506\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/2.png\" alt=\"\" width=\"496\" height=\"178\" \/><\/p>\n<p>Not only will empathetic messages help customers feel reassured, but they’ll also improve your brand reputation and identity. As you continue to engage with your audience in a supportive and encouraging manner, you’ll notice an increase in <strong>audience engagement, retention, and growth<\/strong>.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1512\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/Pro-Tip-1.jpg\" alt=\"\" width=\"1200\" height=\"250\" \/><\/p>\n<p>Here are some great examples by Chick-fil-A and Starbucks:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1507\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/3.png\" alt=\"\" width=\"628\" height=\"366\" \/><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1508\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/4.png\" alt=\"\" width=\"584\" height=\"341\" \/><\/p>\n<p>While we recommend using digital platforms to share your products\/services, take strict measures to avoid blurring the lines between blatant promotion and crisis-friendly branding.<\/p>\n<p>Demarcating each category will help you avoid overstepping, thereby connecting with your customers <em>without<\/em> overselling or capitalizing on the ongoing crisis.<\/p>\n<h2>4. Focus on Reputation Management<\/h2>\n<p>While you may feel compelled to manage your web presence and social media accounts yourself, asking for help is crucial.<\/p>\n<p>As small business owners adopt digital marketing strategies, they’re largely unfamiliar with the subtleties of managing a <a href=\"https:\/\/www.searchberg.com\/business-reputation-management.html\">strong digital reputation<\/a>.<\/p>\n<p>While increased web activity and social media use are extremely beneficial, it can also backfire in some instances.<\/p>\n<p>Receiving negative feedback and false reviews is a common occurrence. However, leaving them unattended could harm your brand in the long run.<\/p>\n<p>As potential customers interact with the negative content, they’re likely to change their minds and look for a competitor who offers similar products\/services. In addition, you run the risk of losing unsatisfied customers by leaving their complaints unattended.<\/p>\n<p>This is where <a href=\"https:\/\/www.searchberg.com\/blog\/8-reasons-to-protect-your-brands-online-reputation-during-the-covid-19-pandemic\/\">reputation management experts<\/a> step in.<\/p>\n<p>They help brands detect and respond to negative feedback in an empathetic, polite, and remedial manner. Moreover, business reputation monitoring and management agents also help remove the factually incorrect information, cyber-attacks, and intentional public vitriol that could cost your brand in the long run.<\/p>\n<h2>5. Create Powerful Web Content<\/h2>\n<figure id=\"attachment_1509\" aria-describedby=\"caption-attachment-1509\" style=\"width: 626px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"size-full wp-image-1509\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/website-design-content-layout-graphic_53876-13764.jpg\" alt=\"\" width=\"626\" height=\"345\" \/><figcaption id=\"caption-attachment-1509\" class=\"wp-caption-text\">Website Design Content Layout Graphic<\/figcaption><\/figure>\n<p>You may have accomplished the feat of creating a visually dynamic, informative, and immersive website.<\/p>\n<p>But this doesn&#8217;t mean that you now get to drop the metaphorical mic and let your social media run itself.<\/p>\n<p>It&#8217;s important to maintain this strong web presence (read: stay relevant) by continuing to share <strong>high-quality blogs, articles, press releases, infographics, and other promotional media <\/strong>because these methods <a href=\"https:\/\/www.searchberg.com\/blog\/5-reasons-why-you-need-power-blog-posts-for-your-website-blog\/\">maximize audience retention<\/a>.<\/p>\n<p>As preexisting customers engage with your content, they’ll be redirected to your products\/services, thereby minimizing customer attrition and ensuring long-term brand growth. Sharing promotional web content also helps attract new audiences.<\/p>\n<p>We recommend developing a crisis-sensitive approach to ensure customers feel acknowledged instead of overwhelmed. Include a powerful yet empathetic CTA to redirect them to your product\/service pages and\/or social media accounts.<\/p>\n<h2>6. Leverage Local SEO Strategies for Higher Rankings<\/h2>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1510\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/1215.jpg\" alt=\"\" width=\"960\" height=\"640\" \/><\/p>\n<p>Focusing on <a href=\"https:\/\/www.searchberg.com\/local-seo-services.html\">local SEO<\/a> is a powerful way to target local audiences and receive higher rankings on SERPs. As people spend more time indoors, they’re actively seeking products\/services that can be delivered to their doorstep.<\/p>\n<p>As you optimize your website for local searches, you’ll successfully increase your local customer base.<\/p>\n<p>Claim your free <a href=\"https:\/\/www.searchberg.com\/blog\/how-to-optimize-google-my-business-listing-and-leverage-it-for-more-sales\/\">Google My Business listing<\/a> to enhance visibility and relevance. We recommend updating the page and sharing posts to receive a higher ranking on Google. Maintain NAP (name, address, and phone number) consistency to improve credibility.<\/p>\n<p>We also suggest optimizing web content—including web copy, blogs, articles, and press releases—based on region-specific keywords. This strategy will help your business climb SERPs and attract more customers.<\/p>\n<p>Use title tags, meta description, header tags, and additional on-page SEO elements to give Google a clear idea of the regional availability of your products\/services.<\/p>\n<h2>7. Leverage Video Marketing<\/h2>\n<p>As one of the <strong>most effective digital marketing tools<\/strong>, video marketing helps brands share their products\/services with customers without losing their attention.<\/p>\n<p>As the average human attention span drops to <a rel=\"nofollow noopener noreferrer\" href=\"https:\/\/time.com\/3858309\/attention-spans-goldfish\/\" target=\"_blank\">8 seconds<\/a>, keeping audiences engaged has become more challenging than ever. While text and image-based content is powerful in its own right, video content has proven to be <em>more<\/em> impactful.<\/p>\n<p>According to research, <a rel=\"nofollow noopener noreferrer\" href=\"https:\/\/www.forbes.com\/sites\/miketempleman\/2017\/09\/06\/17-stats-about-video-marketing\/#122e4308567f\" target=\"_blank\">90%<\/a> of customers admit that product\/service videos play a big role in finalizing their buying decision. In addition, brands that use video content enjoy over <a rel=\"nofollow noopener noreferrer\" href=\"https:\/\/www.forbes.com\/sites\/miketempleman\/2017\/09\/06\/17-stats-about-video-marketing\/#122e4308567f\" target=\"_blank\">41% more web traffic<\/a> than their competitors.<\/p>\n<p>As video emerges at the forefront of marketing, creating engaging, entertaining, and empathetic video content has become more important than ever.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1511\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/smiling-young-man-filming-his-video-blog-episode_171337-5536.jpg\" alt=\"\" width=\"626\" height=\"417\" \/><\/p>\n<p>Whether you create an explainer video that educates your audience about your products\/services or a company culture video that briefly outlines your work-from-home adaptation strategy, video marketing will help build a <strong>strong customer base<\/strong>.<\/p>\n<p>We recommend posting the video content on your website and social media pages for better reach.<\/p>\n<h2>8. Keep Up With Your Competitors!<\/h2>\n<p>Monitor successful local competitors’ websites to develop an idea of different strategies that you could potentially try in the future. While you may have utilized powerful digital marketing tactics, there’s always room for improvement.<\/p>\n<p>We also recommend keeping up with industry trends to stay on top of the competition and sneak in some much-needed inspiration when needed.<\/p>\n<p>Browse through your competitors’ social media pages to <a rel=\"nofollow noopener noreferrer\" href=\"https:\/\/www.forbes.com\/sites\/forbesfinancecouncil\/2019\/02\/26\/15-ways-to-keep-up-with-your-business-competition-even-on-a-budget\/#293c606249ab\" target=\"_blank\">review their engagement<\/a> and customer response strategy. This will help you determine <em>lapses<\/em> in your <strong>audience engagement strategy<\/strong> and update tactics if needed.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1513\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/Pro-Tip-2.jpg\" alt=\"\" width=\"1200\" height=\"250\" \/><\/p>\n<p>Now you have learned everything you need to: <strong>optimize your social media approach<\/strong> for engagement<strong>, <\/strong>update your<strong> brand voice for crisis time, <\/strong>creating<strong> important <\/strong>and<strong> powerful content <\/strong>that<strong> helps and resonates <\/strong>with your<strong> audience, <\/strong>performing <strong>basic SEO practices,<\/strong> and<strong> keeping on top of your competitive research.<\/strong><\/p>\n<p>While this provides you with a strong foundation to help your small business stabilize and even thrive, remember that the work doesn&#8217;t end here, and researching best practices is an ongoing process that evolves just as the pandemic does.<\/p>\n<p>Fortunately, you don&#8217;t have to do it alone.<\/p>\n<p>You can improve your brand visibility and growth by browsing through our expert <a href=\"https:\/\/www.searchberg.com\/small-business-seo.html\">digital marketing services for small businesses<\/a>.<\/p>\n<p>Our <a href=\"https:\/\/www.searchberg.com\/social-media-management.html\">social media management<\/a>, reputation management, <a href=\"https:\/\/www.searchberg.com\/content-marketing.html\">content marketing<\/a>, web design and development, and Pay Per Click (PPC) marketing services are tailored according to cutting-edge SEO trends to ensure better sales and traffic for clients.<\/p>\n<p>As one of the leading award-winning SEO agencies in the U.S., we help small businesses get started at as little as $200.<\/p>\n<p>Call us at <a href=\"tel:8554444777\">855-444-4777<\/a> to get started or <a href=\"https:\/\/www.searchberg.com\/free-proposal.html\">request a quote<\/a>.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; As the COVID-19 lockdown continues, small businesses across the globe have been struggling to keep up with key performance metrics, engage their audience, and retain customers. While these businesses previously relied on local offline marketing strategies rather than internet marketing for long-term growth, the new wave of lockdown-induced digitalization has made it increasingly difficult [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":1515,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[39,11],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>6 Digital Marketing Tips for Small Businesses Struggling to Navigate COVID-19<\/title>\n<meta name=\"description\" content=\"Struggling to grow your business during the COVID-19 crisis? Browse through these powerful digital marketing tips for small local businesses in New York and Orlando.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.searchberg.com\/blog\/6-digital-marketing-tips-for-small-businesses-struggling-to-navigate-covid-19\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"6 Digital Marketing Tips for Small Businesses Struggling to Navigate COVID-19\" \/>\n<meta property=\"og:description\" content=\"Struggling to grow your business during the COVID-19 crisis? Browse through these powerful digital marketing tips for small local businesses in New York and Orlando.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.searchberg.com\/blog\/6-digital-marketing-tips-for-small-businesses-struggling-to-navigate-covid-19\/\" \/>\n<meta property=\"og:site_name\" content=\"Search Berg\" \/>\n<meta property=\"article:published_time\" content=\"2020-05-05T10:41:06+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/6-Digital-Marketing-Tips-for-Small-Businesses-Struggling-to-Navigate-COVID-19-1.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"750\" \/>\n\t<meta property=\"og:image:height\" content=\"544\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Matt Jensen\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"12 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/#website\",\"url\":\"https:\/\/www.searchberg.com\/blog\/\",\"name\":\"Search Berg\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.searchberg.com\/blog\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/6-digital-marketing-tips-for-small-businesses-struggling-to-navigate-covid-19\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/6-Digital-Marketing-Tips-for-Small-Businesses-Struggling-to-Navigate-COVID-19-1.jpg\",\"contentUrl\":\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/6-Digital-Marketing-Tips-for-Small-Businesses-Struggling-to-Navigate-COVID-19-1.jpg\",\"width\":750,\"height\":544},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/6-digital-marketing-tips-for-small-businesses-struggling-to-navigate-covid-19\/#webpage\",\"url\":\"https:\/\/www.searchberg.com\/blog\/6-digital-marketing-tips-for-small-businesses-struggling-to-navigate-covid-19\/\",\"name\":\"6 Digital Marketing Tips for Small Businesses Struggling to Navigate COVID-19\",\"isPartOf\":{\"@id\":\"https:\/\/www.searchberg.com\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.searchberg.com\/blog\/6-digital-marketing-tips-for-small-businesses-struggling-to-navigate-covid-19\/#primaryimage\"},\"datePublished\":\"2020-05-05T10:41:06+00:00\",\"dateModified\":\"2020-05-05T10:41:06+00:00\",\"author\":{\"@id\":\"https:\/\/www.searchberg.com\/blog\/#\/schema\/person\/19ce28927be7bd8123e9881dd09762ca\"},\"description\":\"Struggling to grow your business during the COVID-19 crisis? Browse through these powerful digital marketing tips for small local businesses in New York and Orlando.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.searchberg.com\/blog\/6-digital-marketing-tips-for-small-businesses-struggling-to-navigate-covid-19\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.searchberg.com\/blog\/6-digital-marketing-tips-for-small-businesses-struggling-to-navigate-covid-19\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/6-digital-marketing-tips-for-small-businesses-struggling-to-navigate-covid-19\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.searchberg.com\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"8 Digital Marketing Tips &#038; Tricks for Small Businesses Struggling to Navigate COVID-19\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/#\/schema\/person\/19ce28927be7bd8123e9881dd09762ca\",\"name\":\"Matt Jensen\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/?s=96&d=mm&r=g\",\"caption\":\"Matt Jensen\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"6 Digital Marketing Tips for Small Businesses Struggling to Navigate COVID-19","description":"Struggling to grow your business during the COVID-19 crisis? Browse through these powerful digital marketing tips for small local businesses in New York and Orlando.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.searchberg.com\/blog\/6-digital-marketing-tips-for-small-businesses-struggling-to-navigate-covid-19\/","og_locale":"en_US","og_type":"article","og_title":"6 Digital Marketing Tips for Small Businesses Struggling to Navigate COVID-19","og_description":"Struggling to grow your business during the COVID-19 crisis? Browse through these powerful digital marketing tips for small local businesses in New York and Orlando.","og_url":"https:\/\/www.searchberg.com\/blog\/6-digital-marketing-tips-for-small-businesses-struggling-to-navigate-covid-19\/","og_site_name":"Search Berg","article_published_time":"2020-05-05T10:41:06+00:00","og_image":[{"width":750,"height":544,"url":"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/6-Digital-Marketing-Tips-for-Small-Businesses-Struggling-to-Navigate-COVID-19-1.jpg","path":"\/home\/searchberg\/public_html\/blog\/wp-content\/uploads\/2020\/05\/6-Digital-Marketing-Tips-for-Small-Businesses-Struggling-to-Navigate-COVID-19-1.jpg","size":"full","id":1515,"alt":"","pixels":408000,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"Matt Jensen","Est. reading time":"12 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.searchberg.com\/blog\/#website","url":"https:\/\/www.searchberg.com\/blog\/","name":"Search Berg","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.searchberg.com\/blog\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.searchberg.com\/blog\/6-digital-marketing-tips-for-small-businesses-struggling-to-navigate-covid-19\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/6-Digital-Marketing-Tips-for-Small-Businesses-Struggling-to-Navigate-COVID-19-1.jpg","contentUrl":"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/6-Digital-Marketing-Tips-for-Small-Businesses-Struggling-to-Navigate-COVID-19-1.jpg","width":750,"height":544},{"@type":"WebPage","@id":"https:\/\/www.searchberg.com\/blog\/6-digital-marketing-tips-for-small-businesses-struggling-to-navigate-covid-19\/#webpage","url":"https:\/\/www.searchberg.com\/blog\/6-digital-marketing-tips-for-small-businesses-struggling-to-navigate-covid-19\/","name":"6 Digital Marketing Tips for Small Businesses Struggling to Navigate COVID-19","isPartOf":{"@id":"https:\/\/www.searchberg.com\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.searchberg.com\/blog\/6-digital-marketing-tips-for-small-businesses-struggling-to-navigate-covid-19\/#primaryimage"},"datePublished":"2020-05-05T10:41:06+00:00","dateModified":"2020-05-05T10:41:06+00:00","author":{"@id":"https:\/\/www.searchberg.com\/blog\/#\/schema\/person\/19ce28927be7bd8123e9881dd09762ca"},"description":"Struggling to grow your business during the COVID-19 crisis? Browse through these powerful digital marketing tips for small local businesses in New York and Orlando.","breadcrumb":{"@id":"https:\/\/www.searchberg.com\/blog\/6-digital-marketing-tips-for-small-businesses-struggling-to-navigate-covid-19\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.searchberg.com\/blog\/6-digital-marketing-tips-for-small-businesses-struggling-to-navigate-covid-19\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.searchberg.com\/blog\/6-digital-marketing-tips-for-small-businesses-struggling-to-navigate-covid-19\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.searchberg.com\/blog\/"},{"@type":"ListItem","position":2,"name":"8 Digital Marketing Tips &#038; Tricks for Small Businesses Struggling to Navigate COVID-19"}]},{"@type":"Person","@id":"https:\/\/www.searchberg.com\/blog\/#\/schema\/person\/19ce28927be7bd8123e9881dd09762ca","name":"Matt Jensen","image":{"@type":"ImageObject","@id":"https:\/\/www.searchberg.com\/blog\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/?s=96&d=mm&r=g","caption":"Matt Jensen"}}]}},"_links":{"self":[{"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/posts\/1499"}],"collection":[{"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/comments?post=1499"}],"version-history":[{"count":0,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/posts\/1499\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/media\/1515"}],"wp:attachment":[{"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/media?parent=1499"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/categories?post=1499"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/tags?post=1499"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}