{"id":1516,"date":"2020-05-12T15:44:41","date_gmt":"2020-05-12T15:44:41","guid":{"rendered":"https:\/\/www.searchberg.com\/blog\/?p=1516"},"modified":"2020-05-12T15:44:41","modified_gmt":"2020-05-12T15:44:41","slug":"8-ways-to-adjust-your-seo-strategy-amid-the-ongoing-covid-19-pandemic","status":"publish","type":"post","link":"https:\/\/www.searchberg.com\/blog\/8-ways-to-adjust-your-seo-strategy-amid-the-ongoing-covid-19-pandemic\/","title":{"rendered":"8 Ways to Adjust Your SEO Strategy Amid the Ongoing COVID-19 Pandemic"},"content":{"rendered":"<p>As the COVID-19 pandemic continues—albeit with a flattened curve across many U.S. states—businesses have been increasingly branching out and navigating new marketing strategies.<\/p>\n<p><!--more--><\/p>\n<p>While tried-and-tested offline marketing tactics may have worked in the past, the prolonged period of lockdown has nullified their efficacy. According to Forbes, the global pandemic has pushed internet use by a whopping <a href=\"https:\/\/www.forbes.com\/sites\/markbeech\/2020\/03\/25\/covid-19-pushes-up-internet-use-70-streaming-more-than-12-first-figures-reveal\/#3c7943943104\">70%<\/a>. Alongside this astounding increase, social media engagement has escalated by up to <a href=\"https:\/\/www.forbes.com\/sites\/ryanholmes\/2020\/04\/24\/is-covid-19-social-medias-levelling-up-moment\/#542bed566c60\">61%<\/a>.<\/p>\n<p>Local offline businesses that fail to leverage <a href=\"https:\/\/www.forbes.com\/sites\/bernardmarr\/2020\/03\/20\/why-companies-turn-to-digital-marketing-to-survive-covid-19\/\">the power of digital marketing<\/a> during this crucial period not only notice a dip in metrics, but also suffer customer attrition.<\/p>\n<p>You may be risking temporary or permanent business closure.<\/p>\n<p>With <a href=\"https:\/\/www.cnbc.com\/2020\/04\/14\/7point5-million-small-businesses-are-at-risk-of-closing-report-finds.html\">over 7.5 million companies<\/a> at risk of going out of business, adopting a strong SEO strategy is <em>imperative<\/em> to navigating the rough terrain of COVID-19.<\/p>\n<p>However, this is where the slope becomes more slippery than expected.<\/p>\n<p>Many businesses across the U.S. have been <a href=\"https:\/\/www.forbes.com\/sites\/forbesagencycouncil\/2020\/04\/16\/how-to-leverage-your-seo-rankings-to-expand-internationally\/\">actively leveraging SEO<\/a>. However, they’ve paid little to no attention to the importance of making continual adjustments. Keep in mind, an immutable one-size-fits-all SEO strategy does more damage than good by stagnating audience engagement and retention.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-1527 size-full\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/Pro-Tip-1-1.jpg\" alt=\"rapid\" width=\"1200\" height=\"250\" \/><\/p>\n<p>We’ve rounded up eight ways to adjust your 2020 SEO strategy amid COVID-19 as consumer habits continue to ebb and flow.<\/p>\n<h2>How Will SEO Lead Companies Through COVID-19?<\/h2>\n<h3>1. Closely Monitor Keywords and Create Content Accordingly<\/h3>\n<p>According to a recent survey, <a href=\"https:\/\/www.numerator.com\/resources\/blog\/impact-covid-19-consumer-behavior\">1 in 3 consumers<\/a> admitted that COVID-19 updates impacted their shopping behavior. As the precarious pandemic continues to affect search trends and consumer habits, closely monitoring keywords and creating content accordingly is imperative.<\/p>\n<p>For instance, searches like “<em>work from home covid<\/em>” and “<em>hand washing tips<\/em>” were <em>dominating<\/em> search engines as the COVID-19 curve was forming.<\/p>\n<p>Here’s a glimpse of the rising popularity of “<em>work from home covid<\/em>” during March:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-1519 size-full\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/1.jpg\" alt=\"trends1\" width=\"624\" height=\"304\" \/><\/p>\n<p>However, as the COVID-19 curve hit its apex and began to flatten across several U.S. states, the search requests evolved accordingly.<\/p>\n<p>According to <a href=\"https:\/\/trends.google.com\/trends\/?geo=US\">Google Trends<\/a>, searches like “<em>business opening covid<\/em>” have increased in popularity owing to the eased lockdown restrictions:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-1520 size-full\" style=\"font-size: inherit;\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/2.jpg\" alt=\"trends2\" width=\"624\" height=\"304\" \/><\/p>\n<p>If you’re still using the list of keywords you created as the pandemic was taking shape in the initial months, it may be time to rethink your strategy.<\/p>\n<p>Make periodic adjustments to your <a href=\"https:\/\/www.forbes.com\/sites\/miketempleman\/2017\/03\/28\/5-tips-modern-seo-keyword-research-strategy\/\">keyword research and analysis strategy<\/a>. This is a great way to stay abreast of popular searches and identify relevant topics accordingly.<\/p>\n<p>Familiarize yourself with popular short-tail and long-tail keywords in your niche while identifying time-sensitive keyword modifiers. Creating content around this mix will help you climb SERPs, increase organic search traffic, generate more leads, and build brand credibility.<\/p>\n<p>Incorporate updated keywords in your title tags, meta description tags, image alt attributes, and content (blogs, articles, guest posts, press releases, etc.) to increase visibility and boost revenue. Keeping up with the evolving trends given the volatile and ever-changing nature of the pandemic will not only help your business during this crunch, but also pay off in the long run.<\/p>\n<p>As the curve begins to dip, search requests will shift rapidly, thereby necessitating the development of fresh content with updated keywords.<\/p>\n<p>Closely monitor the fluctuating trends to maximize audience reach and grow your business.<\/p>\n<h3>2. Create an Empathetic and Informative Page About COVID-19<\/h3>\n<p>If your SEO strategy has been solely focused on numbers and metrics, you may be dealing with a cracked foundation that has been affecting your subsequent efforts.<\/p>\n<p>Develop an <a href=\"https:\/\/thriveglobal.com\/stories\/marketing-sans-empathy-during-covid-19-can-be-a-brands-worst-mistake\/\">empathetic approach<\/a> to the crisis to make your audience feel supported, inspired, and heard during a period of ongoing turbulence and uncertainty. Creating an empathetic and informative page about COVID-19 is essential to keep your audience updated about your products\/services and operation while lending much-needed support and encouragement.<\/p>\n<p><a href=\"https:\/\/www.lacoste.com\/gb\/services-specificities.html\">Lacoste’s<\/a> sweet and succinct approach is a great way to give your customers necessary updates in a warm and supportive way.<\/p>\n<h2><img loading=\"lazy\" class=\"aligncenter wp-image-1521 size-full\" style=\"font-size: inherit;\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/3.jpg\" alt=\"lacoste\" width=\"624\" height=\"373\" \/><\/h2>\n<p>As new audiences are directed to your website, they’re more likely to develop a positive notion of your brand presence and engage with your social media pages. This will help convert visitors into leads and boost revenue.<\/p>\n<p><a href=\"https:\/\/www.chipotle.com\/covid19\">Chipotle’s COVID-19 update page<\/a> is another great example of reassuring customers by delineating safety measures.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-1522 size-full\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/4.jpg\" alt=\"chipotle\" width=\"609\" height=\"315\" \/><\/p>\n<p>The clean, visually engaging, and easy-to-follow graphics help visitors retain important information without feeling compelled to click off. This enhances user experience and decreases the bounce rate while imparting vital company updates.<\/p>\n<h3>3. Improve Local SEO by Updating Your Google My Business Listing<\/h3>\n<p>As one of the most powerful local SEO tactics, <a href=\"https:\/\/www.searchberg.com\/blog\/how-to-optimize-google-my-business-listing-and-leverage-it-for-more-sales\/\">updating your Google My Business listing<\/a> is a surefire way to enhance online presence during a time of increasing chaos and uncertainty. The free platform allows business owners to share their business hours, contact number, website address, description, category, FAQs, and posts, thereby boosting visibility on Google search and maps.<\/p>\n<p>Google recently launched <a href=\"https:\/\/support.google.com\/business\/answer\/9773423?hl=en\">new tools and strategies<\/a> in light of the COVID-19 pandemic to help businesses share essential updates with customers.<\/p>\n<p>We recommend updating your <strong>Google My Business<\/strong> listing accordingly to <a href=\"https:\/\/support.google.com\/business\/answer\/7091?hl=en\">improve local SEO and increase revenue<\/a>. Optimize your page by sharing shipping delay updates, products that may be out of stock, updated business hours, safety measures, and donation plans to keep preexisting and potential customers in the loop.<\/p>\n<p>With internet usage across the U.S. at an <a href=\"https:\/\/www.nytimes.com\/interactive\/2020\/04\/07\/technology\/coronavirus-internet-use.html\">all-time high<\/a>, taking these measures is essential to get your business on the map and increase traffic.<\/p>\n<p>According to a study conducted by Google and Oxera, sharing accurate business details on Google My Business increases homepage click-throughs by a whopping <a href=\"https:\/\/www.lifelearn.com\/2020\/03\/16\/optimize-your-google-my-business\/\">30%<\/a>. With <a href=\"https:\/\/www.netmarketshare.com\/search-engine-market-share.aspx?options=%7B%22filter%22%3A%7B%22%24and%22%3A%5B%7B%22deviceType%22%3A%7B%22%24in%22%3A%5B%22Desktop%2Flaptop%22%5D%7D%7D%5D%7D%2C%22dateLabel%22%3A%22Trend%22%2C%22attributes%22%3A%22share%22%2C%22group%22%3A%22searchEngine%22%2C%22sort%22%3A%7B%22share%22%3A-1%7D%2C%22id%22%3A%22searchEnginesDesktop%22%2C%22dateInterval%22%3A%22Monthly%22%2C%22dateStart%22%3A%222017-03%22%2C%22dateEnd%22%3A%222018-02%22%2C%22segments%22%3A%22-1000%22%7D\">80%<\/a> of all searches occurring on Google, optimizing <strong>Google My Business<\/strong> in accordance with the evolving COVID-19 landscape will help your brand stay afloat and maintain a strong brand identity.<\/p>\n<h3>4. Keep Up With the Competition<\/h3>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-1523 size-full\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/photo-1519222970733-f546218fa6d7-1.jpg\" alt=\"an attractive and engaging website open on a laptop screen\" width=\"750\" height=\"500\" \/><\/p>\n<p>While you may be tweaking your SEO strategy every other week, your business is still liable to falling through the cracks of stagnation, unoriginality, and complacency.<\/p>\n<p><a href=\"https:\/\/www.forbes.com\/sites\/stephanieburns\/2020\/02\/02\/why-you-should-love-your-competition\/\">Keeping tabs on your competition<\/a> is a great way to pick up on new SEO tactics that you may have overlooked. We recommend shortlisting 3–5 strong local businesses within the same industry. While a few deviations won’t do any harm, make sure the business offers similar products\/services and has a wide customer base.<\/p>\n<p>Analyze their web presence to identify strengths that you could potentially incorporate into your own scheme and weaknesses that you should steer clear of at all costs.<\/p>\n<p>We also suggest <a href=\"https:\/\/www.forbes.com\/sites\/forbesfinancecouncil\/2019\/02\/26\/15-ways-to-keep-up-with-your-business-competition-even-on-a-budget\/#55ee0ad949ab\">sifting through their social media pages<\/a> to develop an idea about their content, brand voice, and posting frequency. This will help identify lapses within your own strategy, if any.<\/p>\n<p>Once you’ve finalized a list of strong local businesses, expand your search to incorporate successful global companies within your niche. For instance, if your company designs and manufactures furniture, keep an eye out for established brands like IKEA, Ashley Furniture Industries, Herman Miller, and Williams-Sonoma, among others.<\/p>\n<p>Use a competitor analysis tool or <a href=\"https:\/\/www.searchberg.com\/seo-services\/\">consult SEO experts<\/a> to help examine their domain authority, traffic volume, click depth, unique selling point, and COVID-19 digital marketing strategies.<\/p>\n<p>Realign your SEO tactics accordingly to rank higher on search engines and establish a <em>better<\/em> connection with your customers during the ongoing pandemic.<\/p>\n<h3>5. Actively Update Your Website and Social Media Pages<\/h3>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-1524 size-full\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/pexels-photo-607812.jpeg\" alt=\"a phone screen displaying multiple social media icons\" width=\"1400\" height=\"933\" \/><\/p>\n<p>While this may seem like a no-brainer, many businesses have abandoned their website and social media pages during the pandemic owing to interrupted business.<\/p>\n<p>Unfortunately, this can have a detrimental effect on brand identity, audience engagement, and audience retention.<\/p>\n<p>As customers lose touch with your content, they’re more likely to engage with other brands that actively share creative, insightful, and inspirational content. Not only will this increase customer attrition, but it’ll also make your brand seem negligent and apathetic, thereby damaging its <a href=\"https:\/\/www.searchberg.com\/blog\/8-reasons-to-protect-your-brands-online-reputation-during-the-covid-19-pandemic\/\">reputability and trustworthiness<\/a>.<\/p>\n<p>If your business falls in the travel or live entertainment industry, it’s easy to feel like there’s no content to produce or share. However, you can create unique and value-added content despite being unable to continue your services at the moment. For example, you can:<\/p>\n<ul>\n<li>Create powerful blogs, articles, and guest posts to interact with your customers<\/li>\n<li><a href=\"https:\/\/www.searchberg.com\/social-media-marketing.html\">Maintain an active social media presence<\/a> by sharing relevant information and motivational posts on Facebook, Instagram, Twitter, and Pinterest<\/li>\n<li>Respond to queries, feedback, and reviews in a timely and empathetic manner<\/li>\n<\/ul>\n<p>These collective measures will help your brand maintain a strong online presence and increase conversion rates when your operations resume.<\/p>\n<h3>6. Improve Your Site’s Loading Time<\/h3>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-1525 size-full\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/photo-1551288049-bebda4e38f71.jpg\" alt=\"a laptop screen displaying web speed analytics\" width=\"750\" height=\"500\" \/><\/p>\n<p>As one of the most essential SEO strategies, improving your site’s loading time during the COVID-19 pandemic is a great way to <a href=\"https:\/\/neilpatel.com\/blog\/bounce-rate-analytics\/\">reduce your bounce rate<\/a> in the long run and optimize user experience.<\/p>\n<p>A recent case study revealed that faster web pages increase conversion rates by <a href=\"https:\/\/www.section.io\/blog\/how-a-leading-online-beauty-store-increased-sales\/\">over 16.5%<\/a>. Moreover, <a href=\"https:\/\/webmasters.googleblog.com\/2015\/04\/mobilemadness-campaign-to-help-you-go.html\">over 46%<\/a> of web users admit that waiting for web pages to load is the <em>single most disliked aspect<\/em> of their overall browsing experience.<\/p>\n<p>With the large majority of web users expecting a site to load within 2 seconds or less, tweaking your website’s loading time accordingly is imperative.<\/p>\n<p>We recommend using Google’s tool, PageSpeed Insights, to determine the speed of the desktop and mobile versions of your website. Tweak your website by minimizing HTTP requests, optimizing image size and format, removing unused scripts, optimizing caching, and reducing cookie size.<\/p>\n<p>With desktop and mobile-based web usage <a href=\"https:\/\/www.pewresearch.org\/fact-tank\/2020\/04\/02\/8-charts-on-internet-use-around-the-world-as-countries-grapple-with-covid-19\/\">continuing to peak<\/a> as the lockdown regulations remain intact across several states, increasing web efficiency will make a great impression on visitors.<\/p>\n<p>They’re also more likely to interact with your products\/services, blogs, and additional content. This, in turn, increases the likelihood of engagement with social media platforms, which can further boost sales and help establish a wide audience base.<\/p>\n<h3>7. Build Quality Backlinks<\/h3>\n<p>Expanding your network by making the most of <a href=\"https:\/\/www.forbes.com\/sites\/forbesagencycouncil\/2019\/12\/12\/legal-seo-how-to-attract-backlinks-with-your-content\/\">backlink opportunities<\/a> is one of the most effective ways to improve organic search results and get referral traffic.<\/p>\n<p>While the ongoing pandemic has encouraged us to practice social distancing, there’s no harm in indulging in some much-needed digital networking. In fact, it’s a powerful way to stay ahead of your competition and boost revenue.<\/p>\n<p>Backlinks are defined as incoming links to your webpage. This occurs whenever an external website links to your content. As you get virtual shout-outs from established websites with a <a href=\"https:\/\/neilpatel.com\/blog\/boost-your-domain-authority\/\">high domain authority<\/a>, your content is more likely to climb SERPs, thereby increasing visibility for your page.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-1528 size-full\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/Pro-Tip-2-1.jpg\" alt=\"backlinks\" width=\"1200\" height=\"250\" \/><\/p>\n<p>While receiving a plethora of backlinks may sound like the ideal scenario, the <em>quality<\/em> of backlinks plays a significant role. It basically determines whether you’ll reap the benefits.<\/p>\n<p>Let’s say you receive a backlink from an authoritative website like Forbes, Guardian, Entrepreneur, or Architectural Digest. These are definitely going to be a lot more beneficial than receiving one from a local website with weak web design and subpar content.<\/p>\n<p>So what do you do?<\/p>\n<p>Tailor your SEO strategy to incorporate tactics that focus on helping your website receive strong backlinks from authoritative companies.<\/p>\n<p>Check out some of the most effective ways to receive high-quality backlinks:<\/p>\n<ul>\n<li>Using the <a href=\"https:\/\/www.searchberg.com\/blog\/the-art-of-linkbuilding-by-earning-links-through-content-in-2018-and-beyond\/\">broken-link building method<\/a><\/li>\n<li>Creating compelling and value-added content<\/li>\n<li>Increasing social media outreach<\/li>\n<li>Building internal links<\/li>\n<li><a href=\"https:\/\/www.searchberg.com\/blog\/5-benefits-of-guest-blogging-for-small-businesses-owners\/\">Creating guest posts<\/a><\/li>\n<\/ul>\n<p><a href=\"https:\/\/www.searchberg.com\/blog\/the-importance-of-link-building-in-seo\/\">Here’s a resource to help you get started!<\/a><\/p>\n<h3>8. Consult SEO Experts<\/h3>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-1526 size-full\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/interface-3614766_960_720.png\" alt=\"concept illustration of digital marketing metrics on a laptop and phone screen\" width=\"960\" height=\"640\" \/><\/p>\n<p>It may seem like SEO strategizing can pass as a one-man job. But the truth is, the process tends to be much more complex than what meets the eye.<\/p>\n<p>If you’re new to the world of digital marketing, familiarizing yourself with the nuances of SEO can seem overwhelming, to say the least.<\/p>\n<p>In fact, the volatile COVID-19 landscape has caused a <em>massive flux<\/em> that’s <em>begging<\/em> to be unraveled by even the most accomplished business managers and executives.<\/p>\n<p>If you’re struggling to navigate the chaotic crisis and meet KPI targets, it may be time to consult SEO experts. Figuring out how to adjust your 2020 SEO strategy amid COVID-19 isn’t an easy feat to accomplish. At Search Berg, we’re equipped with the expertise, tools, and resources required to make it happen.<\/p>\n<p>As the leading digital marketing agency in the U.S., we offer <a href=\"https:\/\/www.searchberg.com\/\">expert on-page and off-page SEO services<\/a>. Our comprehensive website audit and SEO assessment examines design infrastructure, content, and brand identity to determine the best way forward. In short, we’ll let you in on the winning ways SEO will lead companies through COVID-19 this year!<\/p>\n<p>Here are some core components of our winning SEO process:<\/p>\n<ul>\n<li>Detailed Backlink Audit<\/li>\n<li>Extensive Keyword Research<\/li>\n<li>Business Profile Listings<\/li>\n<li>Link Building Services<\/li>\n<li>SEO Competitor Analysis<\/li>\n<li>Community Management<\/li>\n<li>Content Creation &amp; Marketing<\/li>\n<li>Video\/Infographics<\/li>\n<\/ul>\n<p>Browse through our <a href=\"https:\/\/www.searchberg.com\/how-it-works\/\">SEO project timeline<\/a> for a glimpse of the essential processes your business will undergo.<\/p>\n<p>Our 100% money back guarantee protects small businesses and ensures you see concrete results within 30 days.<\/p>\n<p><a href=\"https:\/\/www.searchberg.com\/free-proposal\/\">Request a quote to get started!<\/a> Our SEO services extend across the U.S., and beyond, including but definitely not limited to New York, Seattle, Orlando, San Diego, and Washington DC.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As the COVID-19 pandemic continues—albeit with a flattened curve across many U.S. states—businesses have been increasingly branching out and navigating new marketing strategies.<\/p>\n","protected":false},"author":2,"featured_media":1517,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[39,2],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>8 Ways to Adjust Your SEO Strategy Amid the Ongoing COVID-19 Pandemic<\/title>\n<meta name=\"description\" content=\"Struggling to adjust your SEO strategy in light of the COVID-19 pandemic? Here are some tips by SEO experts in New York, Seattle, and Orlando.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.searchberg.com\/blog\/8-ways-to-adjust-your-seo-strategy-amid-the-ongoing-covid-19-pandemic\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"8 Ways to Adjust Your SEO Strategy Amid the Ongoing COVID-19 Pandemic\" \/>\n<meta property=\"og:description\" content=\"Struggling to adjust your SEO strategy in light of the COVID-19 pandemic? Here are some tips by SEO experts in New York, Seattle, and Orlando.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.searchberg.com\/blog\/8-ways-to-adjust-your-seo-strategy-amid-the-ongoing-covid-19-pandemic\/\" \/>\n<meta property=\"og:site_name\" content=\"Search Berg\" \/>\n<meta property=\"article:published_time\" content=\"2020-05-12T15:44:41+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/8-Ways-to-Adjust-Your-SEO-Strategy-Amid-the-Ongoing-COVID-19-Pandemic-1.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"750\" \/>\n\t<meta property=\"og:image:height\" content=\"544\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Aaron Tylor\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/#website\",\"url\":\"https:\/\/www.searchberg.com\/blog\/\",\"name\":\"Search Berg\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.searchberg.com\/blog\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/8-ways-to-adjust-your-seo-strategy-amid-the-ongoing-covid-19-pandemic\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/8-Ways-to-Adjust-Your-SEO-Strategy-Amid-the-Ongoing-COVID-19-Pandemic-1.jpg\",\"contentUrl\":\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/8-Ways-to-Adjust-Your-SEO-Strategy-Amid-the-Ongoing-COVID-19-Pandemic-1.jpg\",\"width\":750,\"height\":544,\"caption\":\"concept illustration of how to adjust your 2020 SEO strategy amid COVID-19concept illustration of how to adjust your 2020 SEO strategy amid COVID-19\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/8-ways-to-adjust-your-seo-strategy-amid-the-ongoing-covid-19-pandemic\/#webpage\",\"url\":\"https:\/\/www.searchberg.com\/blog\/8-ways-to-adjust-your-seo-strategy-amid-the-ongoing-covid-19-pandemic\/\",\"name\":\"8 Ways to Adjust Your SEO Strategy Amid the Ongoing COVID-19 Pandemic\",\"isPartOf\":{\"@id\":\"https:\/\/www.searchberg.com\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.searchberg.com\/blog\/8-ways-to-adjust-your-seo-strategy-amid-the-ongoing-covid-19-pandemic\/#primaryimage\"},\"datePublished\":\"2020-05-12T15:44:41+00:00\",\"dateModified\":\"2020-05-12T15:44:41+00:00\",\"author\":{\"@id\":\"https:\/\/www.searchberg.com\/blog\/#\/schema\/person\/eb3152a02ccf43e29aab421c6f16c02b\"},\"description\":\"Struggling to adjust your SEO strategy in light of the COVID-19 pandemic? Here are some tips by SEO experts in New York, Seattle, and Orlando.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.searchberg.com\/blog\/8-ways-to-adjust-your-seo-strategy-amid-the-ongoing-covid-19-pandemic\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.searchberg.com\/blog\/8-ways-to-adjust-your-seo-strategy-amid-the-ongoing-covid-19-pandemic\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/8-ways-to-adjust-your-seo-strategy-amid-the-ongoing-covid-19-pandemic\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.searchberg.com\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"8 Ways to Adjust Your SEO Strategy Amid the Ongoing COVID-19 Pandemic\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/#\/schema\/person\/eb3152a02ccf43e29aab421c6f16c02b\",\"name\":\"Aaron Tylor\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/?s=96&d=mm&r=g\",\"caption\":\"Aaron Tylor\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"8 Ways to Adjust Your SEO Strategy Amid the Ongoing COVID-19 Pandemic","description":"Struggling to adjust your SEO strategy in light of the COVID-19 pandemic? Here are some tips by SEO experts in New York, Seattle, and Orlando.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.searchberg.com\/blog\/8-ways-to-adjust-your-seo-strategy-amid-the-ongoing-covid-19-pandemic\/","og_locale":"en_US","og_type":"article","og_title":"8 Ways to Adjust Your SEO Strategy Amid the Ongoing COVID-19 Pandemic","og_description":"Struggling to adjust your SEO strategy in light of the COVID-19 pandemic? Here are some tips by SEO experts in New York, Seattle, and Orlando.","og_url":"https:\/\/www.searchberg.com\/blog\/8-ways-to-adjust-your-seo-strategy-amid-the-ongoing-covid-19-pandemic\/","og_site_name":"Search Berg","article_published_time":"2020-05-12T15:44:41+00:00","og_image":[{"width":750,"height":544,"url":"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/8-Ways-to-Adjust-Your-SEO-Strategy-Amid-the-Ongoing-COVID-19-Pandemic-1.jpg","path":"\/home\/searchberg\/public_html\/blog\/wp-content\/uploads\/2020\/05\/8-Ways-to-Adjust-Your-SEO-Strategy-Amid-the-Ongoing-COVID-19-Pandemic-1.jpg","size":"full","id":1517,"alt":"concept illustration of how to adjust your 2020 SEO strategy amid COVID-19concept illustration of how to adjust your 2020 SEO strategy amid COVID-19","pixels":408000,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"Aaron Tylor","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.searchberg.com\/blog\/#website","url":"https:\/\/www.searchberg.com\/blog\/","name":"Search Berg","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.searchberg.com\/blog\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.searchberg.com\/blog\/8-ways-to-adjust-your-seo-strategy-amid-the-ongoing-covid-19-pandemic\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/8-Ways-to-Adjust-Your-SEO-Strategy-Amid-the-Ongoing-COVID-19-Pandemic-1.jpg","contentUrl":"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2020\/05\/8-Ways-to-Adjust-Your-SEO-Strategy-Amid-the-Ongoing-COVID-19-Pandemic-1.jpg","width":750,"height":544,"caption":"concept illustration of how to adjust your 2020 SEO strategy amid COVID-19concept illustration of how to adjust your 2020 SEO strategy amid COVID-19"},{"@type":"WebPage","@id":"https:\/\/www.searchberg.com\/blog\/8-ways-to-adjust-your-seo-strategy-amid-the-ongoing-covid-19-pandemic\/#webpage","url":"https:\/\/www.searchberg.com\/blog\/8-ways-to-adjust-your-seo-strategy-amid-the-ongoing-covid-19-pandemic\/","name":"8 Ways to Adjust Your SEO Strategy Amid the Ongoing COVID-19 Pandemic","isPartOf":{"@id":"https:\/\/www.searchberg.com\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.searchberg.com\/blog\/8-ways-to-adjust-your-seo-strategy-amid-the-ongoing-covid-19-pandemic\/#primaryimage"},"datePublished":"2020-05-12T15:44:41+00:00","dateModified":"2020-05-12T15:44:41+00:00","author":{"@id":"https:\/\/www.searchberg.com\/blog\/#\/schema\/person\/eb3152a02ccf43e29aab421c6f16c02b"},"description":"Struggling to adjust your SEO strategy in light of the COVID-19 pandemic? Here are some tips by SEO experts in New York, Seattle, and Orlando.","breadcrumb":{"@id":"https:\/\/www.searchberg.com\/blog\/8-ways-to-adjust-your-seo-strategy-amid-the-ongoing-covid-19-pandemic\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.searchberg.com\/blog\/8-ways-to-adjust-your-seo-strategy-amid-the-ongoing-covid-19-pandemic\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.searchberg.com\/blog\/8-ways-to-adjust-your-seo-strategy-amid-the-ongoing-covid-19-pandemic\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.searchberg.com\/blog\/"},{"@type":"ListItem","position":2,"name":"8 Ways to Adjust Your SEO Strategy Amid the Ongoing COVID-19 Pandemic"}]},{"@type":"Person","@id":"https:\/\/www.searchberg.com\/blog\/#\/schema\/person\/eb3152a02ccf43e29aab421c6f16c02b","name":"Aaron Tylor","image":{"@type":"ImageObject","@id":"https:\/\/www.searchberg.com\/blog\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/?s=96&d=mm&r=g","caption":"Aaron Tylor"}}]}},"_links":{"self":[{"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/posts\/1516"}],"collection":[{"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/comments?post=1516"}],"version-history":[{"count":0,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/posts\/1516\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/media\/1517"}],"wp:attachment":[{"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/media?parent=1516"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/categories?post=1516"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/tags?post=1516"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}