{"id":2504,"date":"2021-01-26T09:30:18","date_gmt":"2021-01-26T09:30:18","guid":{"rendered":"https:\/\/www.searchberg.com\/blog\/?p=2504"},"modified":"2021-01-26T09:30:18","modified_gmt":"2021-01-26T09:30:18","slug":"a-simple-guide-to-getting-started-with-ppc","status":"publish","type":"post","link":"https:\/\/www.searchberg.com\/blog\/a-simple-guide-to-getting-started-with-ppc\/","title":{"rendered":"A Simple Guide to Getting Started with PPC"},"content":{"rendered":"<p>These days, being a business owner or marketer is akin to entering a <em>Baskin Robbins <\/em>franchise and facing decision paralysis because of the sheer <em>volume <\/em>of flavors and choices available.<\/p>\n<p><!--more--><\/p>\n<p>In marketing, there are many avenues you can explore. Some certainly take time to implement and have an incubation period to garner results such as SEO and Content Marketing.<\/p>\n<p>The<strong> fastest <\/strong>way to market all around, though, resoundingly, is <strong><u>PPC&#8211;AKA Pay Per Click Advertising<\/u>.<\/strong><\/p>\n<p>While you may be somewhat familiar with paid advertising and how to become a Google Ads specialist, you may not know what PPC is specifically. Basically, it’s a <strong>paid advertising model for use in Search Engines<\/strong>. In this model, you <strong>only pay every time someone clicks on your ad<\/strong>.<\/p>\n<p>As a bonus, if someone saw your ad and became<strong> aware <\/strong>of your brand but doesn’t click it,<strong> you don’t have to pay for that impression<\/strong>. Since people who saw your ad are now aware of your brand, they’re automatically<em> more likely to click on it <\/em>the next time that they see your ad.<\/p>\n<p><em>Pretty cool, right?<\/em><\/p>\n<p>Learning how to set up PPC ad campaigns in Google can be very lucrative because <em>most online consumers <\/em><em><u>do<\/u><\/em> click on Google Ads when they’re shopping online. And unlike unpaid marketing methods such as SEO, which can take months to yield impressions, clicks, and conversions, <strong><em>PPC yields immediate results<\/em><\/strong>.<\/p>\n<p>But because you don’t want to blow your ad budget on a not-so-great ad that doesn’t actually give you the conversions and click-throughs you desire, it’s crucial to <u>create a solid plan for your PPC campaign<\/u>.<\/p>\n<p>Having a good, thought-through plan also helps you <u>reduce your ad spend<\/u>. This is because the <strong>more relevant <\/strong>your ad is to your target audience’s search keywords, the more a search engine like Google will<strong> reward you with a lower ad cost.<\/strong><\/p>\n<p>Google wants to connect the right ad with an audience that would appreciate it, so they reward the advertisers and businesses that play the game well and according to their rules.<\/p>\n<p>Use our simple guide to make sure you both have a<strong><u> successful campaign<\/u><\/strong>, and search engines reward it so you can <strong><u>lower your costs.<\/u><\/strong><\/p>\n<div class=\"blog-cta style3\">\n<h3>Setting up your PPC campaign can skyrocket your marketing efforts! We’ve been in the game long enough to know what works. Fill out the form to get great results!<\/h3>\n<div class=\"inner\"><form id=\"form2\" name=\"form1\">\n  <input id=\"Subject2\" name=\"Subject\" type=\"hidden\" value=\"Request a Quote (Blog Post Form)\">\n  <div class=\"row\">\n  <div class=\"col\">\n    <input name=\"Name\" type=\"text\" id=\"Name2\" class=\"cforminput-ind\" placeholder=\"Name\">\n  <\/div>\n  <div class=\"col\">\n  \t<input name=\"Website\" type=\"text\" id=\"Website2\" class=\"cforminput-ind4\" placeholder=\"Website\">\n  <\/div>\n  <div class=\"col\">\n    <input name=\"Email\" type=\"email\" id=\"Email2\" class=\"cforminput-ind3\" placeholder=\"Email\">    \n  <\/div>\n  <div class=\"col\">\n    <input name=\"Number\" type=\"tel\" id=\"Number2\" class=\"cforminput-ind2\" placeholder=\"Phone\">\n  <\/div>\n  <\/div>\n  <input id=\"Source1\" name=\"Source\" type=\"hidden\" value=\"19\">\n    <input id=\"country2\" name=\"Country\" type=\"hidden\" value=\"Location of 122.2.98.13: City of Taguig, Philippines\n\">\n  <div class=\"submit-button\"><a href=\"javascript:void(0)\" onclick=\"return validateCaptcha2();\" id=\"home-submit-button\"> Submit Request<\/a><\/div>\n  <div class=\"clear_fix\"><\/div>\n<\/form>\n<\/div>\n<\/div>\n<p>&nbsp;<\/p>\n<h2>Catalog<\/h2>\n<p><a href=\"#_Toc15858\">Phase 1: The Research Phase<\/a><\/p>\n<p><a href=\"#_Toc19244\">Phase 2: The Organization Phase<\/a><\/p>\n<p><a href=\"#_Toc21899\">Phase 3: Check Out Your Competition<\/a><\/p>\n<p><a href=\"#_Toc11837\">Pro Tip: Look into Negative Keywords<\/a><\/p>\n<p><a href=\"#_Toc21223\">Phase 4: Create PPC Ads<\/a><\/p>\n<ol>\n<li><a href=\"#_Toc22039\"> The headline<\/a><\/li>\n<li><a href=\"#_Toc16558\"> The description<\/a><\/li>\n<li><a href=\"#_Toc3432\"> The Display URL<\/a><\/li>\n<\/ol>\n<p><a href=\"#_Toc1771\">Description &amp; Headline: PPC Ad Copy That Converts<\/a><\/p>\n<p><a href=\"#_Toc11198\">Final URL: Have A Solid Landing Page For When Your Prospect Clicks Your Ad<\/a><\/p>\n<p><a href=\"#_Toc14305\">Top PPC Platforms<\/a><\/p>\n<p><a href=\"#_Toc22420\">Google Ads<\/a><\/p>\n<p><a href=\"#_Toc20569\">Bing Ads<\/a><\/p>\n<p><a href=\"#_Toc12766\">Facebook Advertising<\/a><\/p>\n<p><a href=\"#_Toc28544\">Wrapping Up!<\/a><\/p>\n<h2>Phase 1: The Research Phase<\/h2>\n<p>So the result of your research phase will be your <em>keyword list<\/em>. To have a successful campaign, you can’t use just any random keywords. You need to look into<em> who <\/em>your customer is, <em>what <\/em>they want,and most importantly,<em> how <\/em>they’re searching for those wants in search engines.<\/p>\n<p>There’s actually a built-in <strong>keyword searching tool within Google Adwords<\/strong> that you can utilize for this purpose. The tool will ask you for<em> “seed words or phrases.”<\/em> These will be terms you think your ideal customer will search for.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2508\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2021\/01\/blog2-46.png\" alt=\"Google Ads Keyword Searching Tool For pay per click guide\" width=\"828\" height=\"390\" \/><\/p>\n<p>&nbsp;<\/p>\n<p>How are you supposed to know what they are searching for?<\/p>\n<p>One way is to make detailed <em>customer personas <\/em>using the data you have available. Your first list will be everything that you <em>think<\/em> your <strong>ideal customer<\/strong> is looking for. Then, later on, when you’re running campaigns, you can refine this list using the polishing strategy that’s <strong>A\/B testing<\/strong>.<\/p>\n<p>A\/B testing is essentially <u>testing different versions of your ad<\/u> (version A, B, C, etc.) to see which version gets a greater, more efficient response from your target audience. When you know what’s working in your tests, you do more of that for better results.<\/p>\n<p>When you input your<strong> “seed phrases”<\/strong> into Google Adwords, it will spit out a bunch of related keywords that people are searching for alongside their average monthly search volumes and cost per click, among other values. You definitely don’t need to consider them all. The main ones are the <strong>monthly search volume, how competitive each keyword is, and their estimated cost per click. <\/strong><\/p>\n<p>This handy dandy tool also spits out <em>“related” keywords <\/em>that you may not have even thought of but might want to consider looking into using for your campaign.<\/p>\n<p>Another <strong><u>fun fact<\/u><\/strong>: you can specifically target your keywords and <strong><u>get the data for a specific location<\/u><\/strong> that you want to advertise in. For example, if you only want to advertise in specific regions in New York, you can narrow the data you get for search volumes in those places to see what the people in those places’ <em>search patterns <\/em>are like.<\/p>\n<p>Now that you have a whole bunch of juicy, raw data, you can take it and <strong>organize it <\/strong>into specific categories for your ads.<\/p>\n<div class=\"blog-cta style3\">\n<h3>Struggling to understand how setting up a PPC campaign can skyrocket your marketing efforts? We’ve been in the game long enough to know what works and what doesn’t. Fill out the form to get great results!<\/h3>\n<div class=\"inner\"><form id=\"form3\" name=\"form1\">\n  <input id=\"Subject3\" name=\"Subject\" type=\"hidden\" value=\"Request a Quote (Blog Post Form)\">\n  <div class=\"row\">\n  <div class=\"col\">\n    <input name=\"Name\" type=\"text\" id=\"Name3\" class=\"cforminput-ind\" placeholder=\"Your Full Name\">\n  <\/div>\n  <div class=\"col\">\n  \t<input name=\"Website\" type=\"text\" id=\"Website3\" class=\"cforminput-ind4\" placeholder=\"Website\">\n  <\/div>\n  <div class=\"col\">\n    <input name=\"Email\" type=\"email\" id=\"Email3\" class=\"cforminput-ind3\" placeholder=\"Email Address\">    \n  <\/div>\n  <div class=\"col\">\n    <input name=\"Number\" type=\"tel\" id=\"Number3\" class=\"cforminput-ind2\" placeholder=\"Phone Number\">\n  <\/div>\n  <\/div>\n  <input id=\"Source1\" name=\"Source\" type=\"hidden\" value=\"19\">\n    <input id=\"country3\" name=\"Country\" type=\"hidden\" value=\"Location of 122.2.98.13: City of Taguig, Philippines\n\">\n  <div class=\"submit-button\"><a href=\"javascript:void(0)\" onclick=\"return validateCaptcha3();\" id=\"home-submit-button\"> Submit Request<\/a><\/div>\n  <div class=\"clear_fix\"><\/div>\n<\/form>\n<\/div>\n<\/div>\n<h2><a name=\"_Toc19244\"><\/a>Phase 2: The Organization Phase<\/h2>\n<p>In this phase, you’ll <strong>put together keywords that are similar<\/strong> to each other or follow a certain pattern that aligns with each other. When you put them in groups like this that are similar, these groups are called <strong>Ad Groups.<\/strong><\/p>\n<p>The more specific your Ad Groups become, the easier it will become for you to <em><u>create an ad tying all of those keywords together<\/u><\/em> because they already fit together naturally.<\/p>\n<p>When you’re organizing your keywords, you want to keep in mind that users may have varying <strong>intentions <\/strong>when they’re looking for products or services online. Some may search with the intention to<strong> gather information,<\/strong> while others may search for a term with the intention to purchase. The good thing is that you can look at keywords and discern what the searcher’s likely intention is.<\/p>\n<p>You can do this by reading the word and analyzing what might be going through someone’s mind when searching that word or phrase into Google. <u>Shorter,<\/u> one or two-word keywords are generally <u>information seeking<\/u> in nature.<\/p>\n<p>For example: <strong><em>“glue gun”<\/em><\/strong><\/p>\n<p>Compare this with the search term<strong><em> “glue gun cost near me” <\/em><\/strong><\/p>\n<p>Looking at the second keyword, you can tell that the second searcher is far more likely to purchase a glue gun rather than simply gather information about a glue gun, what it is, how it works, etc.<\/p>\n<p>You can still use either or both keywords, depending on<strong> what your campaign goal <\/strong>is. If your goal is to get<strong> more sales<\/strong>, it would make sense to put greater emphasis on “glue gun cost near me” as opposed to just “glue gun.”<\/p>\n<p>But if your goal is<strong> brand recognition<\/strong> or just getting your business’s name out there, you might be able to use both keywords because they both fit that purpose.<\/p>\n<p>If you’re looking for further information regarding how to use the internet to build your personal and business brand, be sure to check out two of our blogs on brand building:<\/p>\n<p><a href=\"https:\/\/www.searchberg.com\/blog\/10-ways-to-build-a-strong-personal-reputation-for-individuals-and-entrepreneurs\/\"><strong>10 Ways to Build a Strong Personal Reputation For Individuals and Entrepreneurs<\/strong><\/a> and<\/p>\n<p><a href=\"https:\/\/www.searchberg.com\/blog\/how-to-build-a-good-reputation-for-your-business-that-will-entice-viewers-and-create-a-positive-brand-image\/\"><strong>How to Build A Good Reputation for Your Business That Will Entice Viewers and Create A Positive Brand Image<\/strong><\/a><\/p>\n<h2><a name=\"_Toc21899\"><\/a>Phase 3: Check Out Your Competition<\/h2>\n<p>Now that you have many assorted keywords organized by Ad Groups, you want to <em>test them out <\/em>and <em>see what kind of ads come up<\/em> when you search them. This will lead you to see ads from your competitors and will be instrumental in your approach because you can spy on what kind of ads they’re running.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2507\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2021\/01\/blog3.jpg\" alt=\"Guide to PPC Competition Keyword Research\" width=\"977\" height=\"385\" \/><\/p>\n<p>This also helps you gauge whether the keyword is good. Suppose you see<strong> many businesses competing<\/strong> over that keyword, <strong>but they’re not within your niche<\/strong>. In this case, that keyword might not be right for you, and there’s no sense in spending good money from your Ad Budget on it.<\/p>\n<p><em>So scrap it.<\/em><\/p>\n<p>On the flip side, if relevant competitors are fighting over a keyword, you know it’s a good keyword that you want to also get in on.<\/p>\n<p>You can also use free tools to watch your competition’s performance, such as <a href=\"https:\/\/www.spyfu.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Spyfu<\/a>.<\/p>\n<h3><a name=\"_Toc11837\"><\/a>Pro Tip: Look into Negative Keywords<\/h3>\n<p><strong>Negative Keywords are keywords that you don’t want to show up in search results for<\/strong>, even if they’re related to your niche. An example of this would be a keyword that’s related to your niche but doesn’t relate to your product. This could look like the use of the word<em> “free”<\/em> in a keyword when you’re trying to make sales.<\/p>\n<p>Using the goal of making sales, it would not be a great match to connect with a customer who’s looking for free items rather than to pay. Therefore, you can put the word “free” as a negative keyword. That way, if someone searches for this keyword in addition to a word or phrase in your keyword list, <strong>Google knows not to show your ad to this person<\/strong>.<\/p>\n<p>This is great because it ultimately<strong> saves you money<\/strong> on pointless impressions and clicks that aren’t a match for both parties to begin with.<\/p>\n<h2><a name=\"_Toc21223\"><\/a>Phase 4: Create PPC Ads<\/h2>\n<p>There are three main components for how to set up your PPC campaign:<\/p>\n<ol>\n<li>The headline<\/li>\n<li>The description<\/li>\n<li>The Display URL<\/li>\n<\/ol>\n<p>You have limited character space for your <em>headline and description,<\/em> so make sure to <strong>take full advantage <\/strong>of the real-estate space the search engine provides you with for the headline and description.<\/p>\n<p>The <em>display URL<\/em> is basically for aesthetic purposes. The ad would go to your landing page that you put into the ad as the “<u>final URL,<\/u>” but the display URL appears on the search engine in the ad itself when your prospect is looking at it.<\/p>\n<p>Aside from Text Ads (also known as <strong>Search Ads<\/strong>), you have the option of choosing:<\/p>\n<ol>\n<li>Display Ads, which consists of text, image, <strong>video<\/strong>, audio, and motion <strong>ads<\/strong><\/li>\n<li>Remarketing Ads<\/li>\n<li>Google Shopping<\/li>\n<li>Gmail Sponsored Ads<\/li>\n<li>Social Ads<\/li>\n<li>Local Service Ads &amp;<\/li>\n<li>Instream Ads<\/li>\n<\/ol>\n<p>For further information regarding video ads, in particular, be sure to check out our video on <a href=\"https:\/\/www.youtube.com\/watch?v=4Fk48tDAVCQ\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Using Video Marketing to Maximize Traffic<\/a>.<\/p>\n<p>Whichever Ad type you use, you will have to <strong>write words to entice your audience <\/strong>to click on them and become part of your <strong>sales funnel<\/strong>. These words make up your ad copy.<\/p>\n<h3><a name=\"_Toc1771\"><\/a>Description &amp; Headline: PPC Ad Copy That Converts<\/h3>\n<p>What people love to click on is<strong> content that’s personalized <\/strong>for them. If you address their <strong>specific pain points and concerns<\/strong>, your prospect will feel seen and validated and therefore is more likely to engage with your ad over others.<\/p>\n<p>Your <strong>keyword research and customer profile<\/strong> will help you understand why your customer would be searching for the terms that you are targeting. What’s the<strong> underlying concern<\/strong> they want to resolve or need that they are trying to meet?<\/p>\n<p>In your <em>Ad Copy<\/em>, you want to emphasize <strong><u>how your product\/company\/business meets the need that this user is searching for<\/u><\/strong>. This is your <strong><u>unique selling proposition or USP<\/u><\/strong>. So you want to <strong><u>include your USP clearly where you can in your Ad<\/u><\/strong> to put it where your prospects can see.<\/p>\n<h3><a name=\"_Toc11198\"><\/a>Final URL: Have a Solid Landing Page for When Your Prospect Clicks Your Ad<\/h3>\n<p>A <strong>solid landing page<\/strong> is a <strong>relevant landing page<\/strong>. Basically, whatever you promise the prospect in your PPC ad itself, you want the landing page that they click on to be relevant to what the ad said. The landing page should<strong> bridge a gap and help solve the same problem<\/strong> with your USP that the ad had summarized for them earlier in the search engine.<\/p>\n<p>An aesthetically appealing landing page is nothing without relevance. That being said,<strong> a good design<\/strong> doesn’t hurt once you have the relevance down.<\/p>\n<p>By creating really specific landing pages tailored for your ads, you essentially <strong>eliminate any extra work a lead may have to do<\/strong> in navigating your site. Less work means less tedious scrolling to navigate your site, which means more time spent digesting <strong><em>why your product and your unique selling point solves their problem<\/em><\/strong><em>. <\/em><\/p>\n<p>This efficient allotment of time spent, in turn, increases your<strong> conversion rate in the PPC campaign you have run<\/strong>.<\/p>\n<p>Now that you have a good idea about running a campaign, let’s look at the best platforms that you can use to run these awesome campaigns on.<\/p>\n<h2><a name=\"_Toc14305\"><\/a>Top PPC Platforms<\/h2>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2506\" src=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2021\/01\/blog2-45.png\" alt=\"concept illustration top PPC platforms\" width=\"970\" height=\"783\" \/><\/p>\n<h3><a name=\"_Toc22420\"><\/a>Google Ads<\/h3>\n<p>Google is a giant and by far the largest search engine on the planet. Even the creator of Amazon, Jeff Bezos, <a href=\"https:\/\/medium.com\/the-innovation\/here-is-why-jeff-bezos-said-treat-google-like-a-mountain-60b5243e5747\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">recently said<\/a> to treat Google like a Mountain: you can climb the mountain, but you can’t move it.<\/p>\n<p>Google isn’t going anywhere, and most of the world is using this platform to search for answers to their problems and queries. So use it to find your target audience because if it’s not on a platform as universal and all-encompassing as Google, it’s likely not anywhere else on the internet.<\/p>\n<h3><a name=\"_Toc20569\"><\/a>Bing Ads<\/h3>\n<p>Bing is also a good platform that you can run PPC campaigns on. The benefit here is that Bing is cheaper to run ads on in terms of cost per click (CPC), but it’s no Google. The audience and reach is definitely smaller for Bing.<\/p>\n<h3><a name=\"_Toc12766\"><\/a>Facebook Advertising<\/h3>\n<p>Facebook Ads is super great for narrowing down to a very specific audience demographic because you can pick out pages, ideas, and topics that have proven interesting in the past. Therefore, you can use your customer profile to the max on this platform and create extremely targeted ads that have the potential for sky-high click-through-rates.<\/p>\n<p>Also, you can utilize the giant that is Instagram Advertising through the Facebook platform as well. For further information on Facebook advertising, including how to get 1000+ likes on Facebook, check out our blog <a href=\"https:\/\/www.searchberg.com\/blog\/how-to-get-more-likes-on-facebook-in-2020\/\">How to Get More Likes on Facebook In 2020<\/a>.<\/p>\n<h2><a name=\"_Toc28544\"><\/a>Wrapping Up!<\/h2>\n<p>Remember that once you use this newfound knowledge to get your ads up and running, your work is far from over. This is because now you need to <strong><u>watch your campaign to see how it performs<\/u><\/strong>. No one can predict this for you. You need to periodically check it, see what’s working, stop campaigns that are simply <strong><em>not performing<\/em><\/strong>, and continue to innovate ads to incorporate what <strong><em>is <\/em><\/strong>working in your campaign.<\/p>\n<p>&nbsp;<\/p>\n<p>Follow this simple guide to PPC advertising to maximize your chances of success.<\/p>\n<p><em>Happy advertising!<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>These days, being a business owner or marketer is akin to entering a Baskin Robbins franchise and facing decision paralysis because of the sheer volume of flavors and choices available.<\/p>\n","protected":false},"author":4,"featured_media":2505,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[12],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>A Simple Guide to Getting Started with PPC - Search Berg<\/title>\n<meta name=\"description\" content=\"Interested in Pay Per Click Advertising but not sure where to start? If you’re looking for a simple, comprehensive guide to navigating the lucrative world of PPC Marketing, we’ve rounded up some tips to boost your ROI in this guide!\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.searchberg.com\/blog\/a-simple-guide-to-getting-started-with-ppc\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"A Simple Guide to Getting Started with PPC - Search Berg\" \/>\n<meta property=\"og:description\" content=\"Interested in Pay Per Click Advertising but not sure where to start? If you’re looking for a simple, comprehensive guide to navigating the lucrative world of PPC Marketing, we’ve rounded up some tips to boost your ROI in this guide!\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.searchberg.com\/blog\/a-simple-guide-to-getting-started-with-ppc\/\" \/>\n<meta property=\"og:site_name\" content=\"Search Berg\" \/>\n<meta property=\"article:published_time\" content=\"2021-01-26T09:30:18+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2021\/01\/blog2-44-1.png\" \/>\n\t<meta property=\"og:image:width\" content=\"750\" \/>\n\t<meta property=\"og:image:height\" content=\"544\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jonathan Mears\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"12 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/#website\",\"url\":\"https:\/\/www.searchberg.com\/blog\/\",\"name\":\"Search Berg\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.searchberg.com\/blog\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/a-simple-guide-to-getting-started-with-ppc\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2021\/01\/blog2-44-1.png\",\"contentUrl\":\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2021\/01\/blog2-44-1.png\",\"width\":750,\"height\":544,\"caption\":\"concept illustration introduction to PPC marketingguide\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/a-simple-guide-to-getting-started-with-ppc\/#webpage\",\"url\":\"https:\/\/www.searchberg.com\/blog\/a-simple-guide-to-getting-started-with-ppc\/\",\"name\":\"A Simple Guide to Getting Started with PPC - Search Berg\",\"isPartOf\":{\"@id\":\"https:\/\/www.searchberg.com\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.searchberg.com\/blog\/a-simple-guide-to-getting-started-with-ppc\/#primaryimage\"},\"datePublished\":\"2021-01-26T09:30:18+00:00\",\"dateModified\":\"2021-01-26T09:30:18+00:00\",\"author\":{\"@id\":\"https:\/\/www.searchberg.com\/blog\/#\/schema\/person\/8f91fb3ab0a7618b7b69a13da9df3aff\"},\"description\":\"Interested in Pay Per Click Advertising but not sure where to start? If you\\u2019re looking for a simple, comprehensive guide to navigating the lucrative world of PPC Marketing, we\\u2019ve rounded up some tips to boost your ROI in this guide!\",\"breadcrumb\":{\"@id\":\"https:\/\/www.searchberg.com\/blog\/a-simple-guide-to-getting-started-with-ppc\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.searchberg.com\/blog\/a-simple-guide-to-getting-started-with-ppc\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/a-simple-guide-to-getting-started-with-ppc\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.searchberg.com\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"A Simple Guide to Getting Started with PPC\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/#\/schema\/person\/8f91fb3ab0a7618b7b69a13da9df3aff\",\"name\":\"Jonathan Mears\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/?s=96&d=mm&r=g\",\"caption\":\"Jonathan Mears\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"A Simple Guide to Getting Started with PPC - Search Berg","description":"Interested in Pay Per Click Advertising but not sure where to start? If you’re looking for a simple, comprehensive guide to navigating the lucrative world of PPC Marketing, we’ve rounded up some tips to boost your ROI in this guide!","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.searchberg.com\/blog\/a-simple-guide-to-getting-started-with-ppc\/","og_locale":"en_US","og_type":"article","og_title":"A Simple Guide to Getting Started with PPC - Search Berg","og_description":"Interested in Pay Per Click Advertising but not sure where to start? If you’re looking for a simple, comprehensive guide to navigating the lucrative world of PPC Marketing, we’ve rounded up some tips to boost your ROI in this guide!","og_url":"https:\/\/www.searchberg.com\/blog\/a-simple-guide-to-getting-started-with-ppc\/","og_site_name":"Search Berg","article_published_time":"2021-01-26T09:30:18+00:00","og_image":[{"width":750,"height":544,"url":"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2021\/01\/blog2-44-1.png","path":"\/home\/hjm6c04lpn01\/public_html\/blog\/wp-content\/uploads\/2021\/01\/blog2-44-1.png","size":"full","id":2505,"alt":"concept illustration introduction to PPC marketingguide","pixels":408000,"type":"image\/png"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"Jonathan Mears","Est. reading time":"12 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.searchberg.com\/blog\/#website","url":"https:\/\/www.searchberg.com\/blog\/","name":"Search Berg","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.searchberg.com\/blog\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.searchberg.com\/blog\/a-simple-guide-to-getting-started-with-ppc\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2021\/01\/blog2-44-1.png","contentUrl":"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2021\/01\/blog2-44-1.png","width":750,"height":544,"caption":"concept illustration introduction to PPC marketingguide"},{"@type":"WebPage","@id":"https:\/\/www.searchberg.com\/blog\/a-simple-guide-to-getting-started-with-ppc\/#webpage","url":"https:\/\/www.searchberg.com\/blog\/a-simple-guide-to-getting-started-with-ppc\/","name":"A Simple Guide to Getting Started with PPC - Search Berg","isPartOf":{"@id":"https:\/\/www.searchberg.com\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.searchberg.com\/blog\/a-simple-guide-to-getting-started-with-ppc\/#primaryimage"},"datePublished":"2021-01-26T09:30:18+00:00","dateModified":"2021-01-26T09:30:18+00:00","author":{"@id":"https:\/\/www.searchberg.com\/blog\/#\/schema\/person\/8f91fb3ab0a7618b7b69a13da9df3aff"},"description":"Interested in Pay Per Click Advertising but not sure where to start? If you’re looking for a simple, comprehensive guide to navigating the lucrative world of PPC Marketing, we’ve rounded up some tips to boost your ROI in this guide!","breadcrumb":{"@id":"https:\/\/www.searchberg.com\/blog\/a-simple-guide-to-getting-started-with-ppc\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.searchberg.com\/blog\/a-simple-guide-to-getting-started-with-ppc\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.searchberg.com\/blog\/a-simple-guide-to-getting-started-with-ppc\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.searchberg.com\/blog\/"},{"@type":"ListItem","position":2,"name":"A Simple Guide to Getting Started with PPC"}]},{"@type":"Person","@id":"https:\/\/www.searchberg.com\/blog\/#\/schema\/person\/8f91fb3ab0a7618b7b69a13da9df3aff","name":"Jonathan Mears","image":{"@type":"ImageObject","@id":"https:\/\/www.searchberg.com\/blog\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/?s=96&d=mm&r=g","caption":"Jonathan Mears"}}]}},"_links":{"self":[{"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/posts\/2504"}],"collection":[{"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/comments?post=2504"}],"version-history":[{"count":0,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/posts\/2504\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/media\/2505"}],"wp:attachment":[{"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/media?parent=2504"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/categories?post=2504"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/tags?post=2504"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}