{"id":838,"date":"2018-01-10T11:48:59","date_gmt":"2018-01-10T11:48:59","guid":{"rendered":"http:\/\/www.searchberg.com\/blog\/?p=838"},"modified":"2018-01-10T11:48:59","modified_gmt":"2018-01-10T11:48:59","slug":"get-ranked-high-in-2018-detailed-list-of-proven-seo-techniques","status":"publish","type":"post","link":"https:\/\/www.searchberg.com\/blog\/get-ranked-high-in-2018-detailed-list-of-proven-seo-techniques\/","title":{"rendered":"Get Ranked High in 2018: A Detailed List of Proven SEO Techniques"},"content":{"rendered":"<h3>Get Ranked High in 2018: A Detailed List of Proven SEO Techniques That Small Businesses and Startups can Utilize to Rank Their Website High in Google and Start Generating Leads!<\/h3>\n<p>The battle for online dominance is well underway. Already, new strategies are being formulated based on the latest Google data; with new trends identified; new niches diversified; and new opportunities, exemplified. How well these opportunities are used will determine how well a website ranks in Google, imports traffic and maintains its lead in its target niche(s); for its target keywords over its target audience. And this is just day 5.<\/p>\n<h2>Welcome to 2018.<\/h2>\n<p>To find a surefire plan on how to rank on Google in 2018 and receive high volumes of traffic is the primary objective of every website and SEO campaign. In this post, we are going to get down to the nitty gritty and offer our readers a quick checklist of proven SEO techniques that will be instrumental in 2018. Notice we mention the word <em><i>proven<\/i><\/em>, meaning that we have not only seen extremely positive results from these strategies for our own clients, but we are also seeing Google put more emphasis and importance to these factors in its organic rankings.<\/p>\n<p>So without further ado, here is a quick SEO checklist 2018 that Small Businesses and Startups should seriously consider for their website SEO. People, who are new to internet marketing, feel free to leave a comment below for our Search Specialists or call or email <a href=\"http:\/\/searchberg.com\">Search Berg<\/a> directly with your queries. Bottom line: Do these things right and you are pretty much assured to rank high on Google in 2018 and generate quality leads.<\/p>\n<h2>Do Keyword Research Over and Over and Over<\/h2>\n<p>This is and it should be, the very first step an internet marketing company should take when performing SEO. Search Berg has an extremely comprehensive and exhaustive process for Keyword Research. This is because we think it is the most important aspect of an SEO campaign.<\/p>\n<p>Target the right keywords and you are going to see traffic and rankings. Period. Focusing on the wrong keywords will bring no results whatsoever even if you are ranking high for those terms because either very few people are entering those search terms online or the terms are totally irrelevant to your website and surfers are leaving annoyed resulting in a high bounce rate; a negative ranking factor according to Google by the way.<\/p>\n<p>There are two things to keep in mind when doing keyword research. Most companies focus on one aspect. Very few focus on both. The first thing to know about KWR is that this should be the first thing one should do for a website. The second thing is to keep redoing it every 6 months in order to discover new keywords, new niches or new search terms to focus on.<\/p>\n<p>Remember the more <em><i>relevant<\/i><\/em> keywords you rank for, the better your overall rankings will be and often times websites rankings high for hundreds of long tail keywords will eventually start ranking high for short-tail keywords as well which are more competitive and bring more leads.<\/p>\n<p>Take it from the Pros. Do Keyword Research. Do it again in 6 months. Repeat.<\/p>\n<h2>Create the Best Content That Is Out There<\/h2>\n<p>Content has enjoyed being center stage since Panda and Penguin and if there one thing for certain; that is that <a href=\"http:\/\/www.searchberg.com\/content-marketing.html\"><u>Content Marketing<\/u><\/a> will continue to play an integral role on multiple fronts; be it SERP rankings; gaining online authority and notoriety or influencing a user’s decision to make a purchase or transaction on a website. To discover how to rank in 2018, content and its marketing are the essential keys.<\/p>\n<p>Google is very particular about content and strives to ensure that the most relevant <strong><b>and<\/b><\/strong> popular content is displayed in the search results for any entered keyword. Content for each page needs to be specific and has an agenda behind it. Users need to see the information they are searching for online. Only then will they be able to have a positive online experience; something that Google rewards abundantly with high rankings, high traffic and high sales.<\/p>\n<p>So basically, you did your homework in Keyword Research and made sure that when a user typed in a certain phrase, they saw your page in the top 10 and clicked on it. Now bring them home with Content. The page that loads up should have the right headings, the right content, the right tone, the right images, the right citations, and the right call-to-action to convince the reader that he or she has arrived at the right place. This will lead to a conversion which can be anything from signing up for a newsletter to making a purchase.<\/p>\n<h2>Create Accessible and Crawlable SEO Optimized Pages and URLs:<\/h2>\n<p>Often called Spiders, Google uses them to index a website and its pages. They are responsible for “reading” your website and to determine what it is about and how to rank the home and landing pages accordingly. It is important for all of these pages to be properly optimized in SEO.<\/p>\n<h2><strong><b>Quick Checklist:<\/b><\/strong><\/h2>\n<p>A few things to look for:<\/p>\n<ul>\n<li>SEO friendly Title and Description Tags and Headings\n<ul>\n<li>Regarded as one of the most important ranking factors, the more accurate the title is in describing your page, the better.<\/li>\n<li>It is still being debated whether Google still uses the Description tag. Most say it doesn’t but there is sufficient data to suggest otherwise. Regardless, this data is for the surfer and the better optimized it is visually and from an SEO perspective, the better.<\/li>\n<li>Prompt use of the Heading tags with H1 leading the way. It should include a keyword.<\/li>\n<\/ul>\n<\/li>\n<li>Sufficient Word Count and Deep linking\n<ul>\n<li>More content on your site helps the crawler to determine what the page or site is about. Careful not to overdo this. Too much content and the page looks tedious and could results in people leaving your site.<\/li>\n<li>Same goes for links. Landing pages should be internally connected where appropriate. Notice we are not talking about inbound links but internal links or deep linking as it is referred to in the SEO world.<\/li>\n<\/ul>\n<\/li>\n<li>SEO Friendly URL.\n<ul>\n<li>No numbers or special characters<\/li>\n<li>Should be named after the page or its content<\/li>\n<\/ul>\n<\/li>\n<li>Fast Load Time:\n<ul>\n<li>If your website is taking more than 2 second to load, it should be optimized. If it’s more than 3 seconds, that can seen as a negative user experience by Google. Try to reduce the page size. Use fewer images or optimized images that are compressed by default. Page load time is a ranking factor. The quicker it loads, the better experience for the surfer.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<h2>Keep Your Enemies Closer with Frequent Competitor Analysis<\/h2>\n<p>The grass is always greener on the other side. And this bitter truth is enough to make one envy of the neighbors. Well, don’t envy and get ready to make your grass not greener but greenest in the town by discovering what they are doing for this purpose. Don’t worry, Search Berg got your back. We will help you do highly effective competitor analysis.<\/p>\n<h3>Importance of Determining Your Competitors<\/h3>\n<p>You know professional players, in addition to training hard to improve their performance, meticulously study every move of their opponents to take advantage of their weak points. And they do so when they know their opponents. I am sure got the idea I am trying to make here. Start with this positive approach and taking the lead will get much easier for you.<\/p>\n<p>Competitor analysis is one of the core factors to make a fail-safe SEO strategy to rank high on any search engine you want i.e. Google, Yahoo! or Bing. By the way, our focused search engine to rank is Google and you know why!<\/p>\n<p>The following factors are to be analyzed for competitor analysis;<\/p>\n<ul>\n<li>Determine Your Competitors<\/li>\n<li>On-Page Content<\/li>\n<li>Off-Page SEO (Backlink Profile)<\/li>\n<li><a href=\"http:\/\/www.searchberg.com\/ppc-marketing.html\"><u>Paid Marketing Campaigns<\/u><\/a><\/li>\n<li>Social Media Profile<\/li>\n<\/ul>\n<h3><strong><b>How to Determine Your Competitors?<\/b><\/strong><\/h3>\n<p>In common practice, especially SEOs in their honeymoon period, assume all 10 blue links on Google’s first page are their competitors, but some of them are really not. In fact, some of them are too huge to even consider going against. So firstly you have to choose against whom you have to compete and then against whom you can compete. A little scary, right? Told you, Search Berg got your back, so don’t worry and take notes of every piece of advice given to you here.<\/p>\n<p>For example, I take plumbing as the niche here to explain further. By the way, I assume that you have already made and finalized your keyword research.<\/p>\n<p>I am taking ‘residential plumbing services in New York city’ as the key phrase. The very first results you see are of either PPC or Google Maps.<\/p>\n<ul>\n<li>PPC results are generated via paid and you have to go with PPC analysis and marketing to beat those results. You can read more details about PPC here.<\/li>\n<li>Google Maps showing business details are your direct competitors.<\/li>\n<\/ul>\n<p>Now you can see 10 more, and sometimes fewer, results. You have to find out your competitors out of Google Maps and the 10 results. Beating the results of Google Maps is a different story which we already have discussed in this article on our blog.  So we move on to the remaining ones to see who you are up against in the brutal and treacherous game of Google ranking. Let’s shrink this list further. How?<\/p>\n<p>Please, have a look and you will see a few sites, which are business directories or review platforms. They serve searchers to find the best services in business. So you might see some or all of the following sites. (At the time I searched, I did).<\/p>\n<ul>\n<li>angieslist.com<\/li>\n<li>thumbtack.com<\/li>\n<li>homeadvisor.com<\/li>\n<li>yelp.com<\/li>\n<\/ul>\n<p>Luckily, they are not your competitors but facilitators. To fully understand and utilize the power of these sites for your business, read this article.<\/p>\n<p>This process will narrow the number of your competitors to 5 or 6. Isn’t it cool to knock out a few players before the game begins? In fact, some of them just became you allies.<\/p>\n<p>Now make an excel sheet and copy the remaining URLs. Visit all sites to have a look and feel of their websites and you are ready to do the first half part of SWOT Analysis, the integral elements in competitor analysis.<\/p>\n<p>To learn about the remaining steps of competitor analysis, please see this comprehensive guide here.<\/p>\n<h1 style=\"text-align: center;\">To Get a Comprehensive SEO &amp; SWOT Analysis Report of Your Website for FREE, Fill in the Form.<\/h1>\n<h3>Go Mobile, Now!<\/h3>\n<p>All of the above mentioned strategies that we have mentioned so far have a proven track record of bringing good results. However, these results are limited to desktop screens. What about mobile results? And results on iPad?<\/p>\n<p>Word of caution, if your website does not have a mobile version, it will <strong><b>not<\/b><\/strong> be displayed in Google mobile results no matter how well optimized the site is from an SEO perspective. Therefore a mobile friendly version of your website is required. This is essentially Google twisting everyone’s arm to make them go Mobile Friendly but this deliberate act is in fact in the website owner’s good interest.<\/p>\n<p>Nowadays, more people perform a Google search from mobile phones than desktop machines. Mobile traffic is slated to outperform desktop traffic and will eventually leave it way behind in the coming years. Make sure a mobile friendly version of your website is accessible to smart phones and tablet devices.<\/p>\n<p>As an <a href=\"http:\/\/www.searchberg.com\/internet-marketing.html\"><u>internet marketing company<\/u><\/a> with 10 years of experience in the Search industry, Search Berg has enjoyed tremendous success by creating, refining and redefining SEO strategies over time. It is the quintessential element of success of our business model. We adapt. The strategies mentioned above are a result of thousands of hours of tedious Google data analysis, painstaking experimentation, lots of trial and error, and never ending collaboration and debate among Search Specialists…and lots and lots of Coffee!<\/p>\n<p>We hope you enjoyed this post. Be sure to provide your feedback via comments below. If you are a small business or a startup looking to improve your website’s SEO performance or you are someone who is simply looking for a professional SEO agency to take care of your website’s marketing efforts, contact us directly and receive a free Audit report. Thanks for reading. We’ll see you again next week with another edition of Search Berg’s Food for Thought Friday!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Get Ranked High in 2018: A Detailed List of Proven SEO Techniques That Small Businesses and Startups can Utilize to Rank Their Website High in Google and Start Generating Leads! The battle for online dominance is well underway. Already, new strategies are being formulated based on the latest Google data; with new trends identified; new [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":890,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[14,11],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Get Ranked High in 2018: A Detailed List of Proven SEO Techniques - Search Berg<\/title>\n<meta name=\"description\" content=\"Stuck with not-so-great Google rankings? Here’s a detailed list of proven SEO strategies to help you dominate the web for your industry!\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.searchberg.com\/blog\/get-ranked-high-in-2018-detailed-list-of-proven-seo-techniques\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Get Ranked High in 2018: A Detailed List of Proven SEO Techniques - Search Berg\" \/>\n<meta property=\"og:description\" content=\"Stuck with not-so-great Google rankings? Here’s a detailed list of proven SEO strategies to help you dominate the web for your industry!\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.searchberg.com\/blog\/get-ranked-high-in-2018-detailed-list-of-proven-seo-techniques\/\" \/>\n<meta property=\"og:site_name\" content=\"Search Berg\" \/>\n<meta property=\"article:published_time\" content=\"2018-01-10T11:48:59+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2018\/01\/Get-Ranked-High-in-2018-1-1.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"750\" \/>\n\t<meta property=\"og:image:height\" content=\"544\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Aaron Tylor\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/#website\",\"url\":\"https:\/\/www.searchberg.com\/blog\/\",\"name\":\"Search Berg\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.searchberg.com\/blog\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/get-ranked-high-in-2018-detailed-list-of-proven-seo-techniques\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2018\/01\/Get-Ranked-High-in-2018-1-1.jpg\",\"contentUrl\":\"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2018\/01\/Get-Ranked-High-in-2018-1-1.jpg\",\"width\":750,\"height\":544},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/get-ranked-high-in-2018-detailed-list-of-proven-seo-techniques\/#webpage\",\"url\":\"https:\/\/www.searchberg.com\/blog\/get-ranked-high-in-2018-detailed-list-of-proven-seo-techniques\/\",\"name\":\"Get Ranked High in 2018: A Detailed List of Proven SEO Techniques - Search Berg\",\"isPartOf\":{\"@id\":\"https:\/\/www.searchberg.com\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.searchberg.com\/blog\/get-ranked-high-in-2018-detailed-list-of-proven-seo-techniques\/#primaryimage\"},\"datePublished\":\"2018-01-10T11:48:59+00:00\",\"dateModified\":\"2018-01-10T11:48:59+00:00\",\"author\":{\"@id\":\"https:\/\/www.searchberg.com\/blog\/#\/schema\/person\/eb3152a02ccf43e29aab421c6f16c02b\"},\"description\":\"Stuck with not-so-great Google rankings? Here\\u2019s a detailed list of proven SEO strategies to help you dominate the web for your industry!\",\"breadcrumb\":{\"@id\":\"https:\/\/www.searchberg.com\/blog\/get-ranked-high-in-2018-detailed-list-of-proven-seo-techniques\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.searchberg.com\/blog\/get-ranked-high-in-2018-detailed-list-of-proven-seo-techniques\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/get-ranked-high-in-2018-detailed-list-of-proven-seo-techniques\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.searchberg.com\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Get Ranked High in 2018: A Detailed List of Proven SEO Techniques\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/#\/schema\/person\/eb3152a02ccf43e29aab421c6f16c02b\",\"name\":\"Aaron Tylor\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.searchberg.com\/blog\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/?s=96&d=mm&r=g\",\"caption\":\"Aaron Tylor\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Get Ranked High in 2018: A Detailed List of Proven SEO Techniques - Search Berg","description":"Stuck with not-so-great Google rankings? Here’s a detailed list of proven SEO strategies to help you dominate the web for your industry!","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.searchberg.com\/blog\/get-ranked-high-in-2018-detailed-list-of-proven-seo-techniques\/","og_locale":"en_US","og_type":"article","og_title":"Get Ranked High in 2018: A Detailed List of Proven SEO Techniques - Search Berg","og_description":"Stuck with not-so-great Google rankings? Here’s a detailed list of proven SEO strategies to help you dominate the web for your industry!","og_url":"https:\/\/www.searchberg.com\/blog\/get-ranked-high-in-2018-detailed-list-of-proven-seo-techniques\/","og_site_name":"Search Berg","article_published_time":"2018-01-10T11:48:59+00:00","og_image":[{"width":750,"height":544,"url":"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2018\/01\/Get-Ranked-High-in-2018-1-1.jpg","path":"\/home\/searchberg\/public_html\/blog\/wp-content\/uploads\/2018\/01\/Get-Ranked-High-in-2018-1-1.jpg","size":"full","id":890,"alt":"","pixels":408000,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"Aaron Tylor","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.searchberg.com\/blog\/#website","url":"https:\/\/www.searchberg.com\/blog\/","name":"Search Berg","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.searchberg.com\/blog\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.searchberg.com\/blog\/get-ranked-high-in-2018-detailed-list-of-proven-seo-techniques\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2018\/01\/Get-Ranked-High-in-2018-1-1.jpg","contentUrl":"https:\/\/www.searchberg.com\/blog\/wp-content\/uploads\/2018\/01\/Get-Ranked-High-in-2018-1-1.jpg","width":750,"height":544},{"@type":"WebPage","@id":"https:\/\/www.searchberg.com\/blog\/get-ranked-high-in-2018-detailed-list-of-proven-seo-techniques\/#webpage","url":"https:\/\/www.searchberg.com\/blog\/get-ranked-high-in-2018-detailed-list-of-proven-seo-techniques\/","name":"Get Ranked High in 2018: A Detailed List of Proven SEO Techniques - Search Berg","isPartOf":{"@id":"https:\/\/www.searchberg.com\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.searchberg.com\/blog\/get-ranked-high-in-2018-detailed-list-of-proven-seo-techniques\/#primaryimage"},"datePublished":"2018-01-10T11:48:59+00:00","dateModified":"2018-01-10T11:48:59+00:00","author":{"@id":"https:\/\/www.searchberg.com\/blog\/#\/schema\/person\/eb3152a02ccf43e29aab421c6f16c02b"},"description":"Stuck with not-so-great Google rankings? Here’s a detailed list of proven SEO strategies to help you dominate the web for your industry!","breadcrumb":{"@id":"https:\/\/www.searchberg.com\/blog\/get-ranked-high-in-2018-detailed-list-of-proven-seo-techniques\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.searchberg.com\/blog\/get-ranked-high-in-2018-detailed-list-of-proven-seo-techniques\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.searchberg.com\/blog\/get-ranked-high-in-2018-detailed-list-of-proven-seo-techniques\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.searchberg.com\/blog\/"},{"@type":"ListItem","position":2,"name":"Get Ranked High in 2018: A Detailed List of Proven SEO Techniques"}]},{"@type":"Person","@id":"https:\/\/www.searchberg.com\/blog\/#\/schema\/person\/eb3152a02ccf43e29aab421c6f16c02b","name":"Aaron Tylor","image":{"@type":"ImageObject","@id":"https:\/\/www.searchberg.com\/blog\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/?s=96&d=mm&r=g","caption":"Aaron Tylor"}}]}},"_links":{"self":[{"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/posts\/838"}],"collection":[{"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/comments?post=838"}],"version-history":[{"count":0,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/posts\/838\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/media\/890"}],"wp:attachment":[{"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/media?parent=838"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/categories?post=838"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.searchberg.com\/blog\/wp-json\/wp\/v2\/tags?post=838"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}